import React from "react";
import { Link } from "react-router-dom";

export const allohNames = [
  {
    arabic: "الله‎",
    name: "Аллоҳ",
    desc: "Аллоҳ лафзи «алаҳа» феълидан олинган «илоҳ» масдарига мансуб бўлиб маъбуд-ибодат қилинувчи зот маъносини англатади. Арабларда «илоҳ»нинг алиф ва лом ҳарфлари киритилган ва «алилоҳу» ҳосил бўлган. Сўнгра ҳамзанинг ҳаракати ломи таърифга нақл қилинган ва бир жинсдаги икки ҳарф идғом қилингандан кейин «Аллоҳ» лафзи ҳосил бўлган. Аллоҳ лафзи яккаю ягона Маъбуди ҳаққа исм бўлиб қолган. У зотдан бошқага бу исм ишлатилмаган.",
  },
  {
    arabic: "الرَّحْمَنُ",
    name: "ар-Роҳман",
    desc: "Улуғ неъматларни берувчи. Бу сифат фақат Аллоҳга хос бўлиб, барчага кофирга ҳам, мўминга ҳам меҳрибон ва неъмат берувчи маъносини англатади. Раҳмон сифатини Аллоҳ таолодан бошқа ҳеч кимга нисбатан ишлатиб бўлмайди.",
  },
  {
    arabic: "الرَّحِيمُ",
    name: "ар-Роҳийм",
    desc: "Латиф неъматлар берувчи. Бу сифат хосроқ бўлиб, «Қиёмат куни фақат мўминларга раҳм қилувчи» маъносини англатади. Бу исм Аллоҳдан ўзгаларга, жумладан Пайғамбар алайҳиссаломга нисбатан ҳам ишлатилади.\nАллоҳнинг ар-Роҳийм исми ат-Таввоб, ал-Ғофур, ар-Роуф, ал-Вадуд, ал-Азийз сифатлари билан ёнма ён келган, чунки ар-Роҳийм сифати хос раҳмат, ар-Роҳман сифати эса умумий раҳматдир.",
  },
  {
    arabic: "الْمَلِكُ",
    name: "ал-Малик",
    desc: "Барча нарсани эгаси. «Малик» ҳақиқий эгадир. Ундан ўзга эга йўқдир. Шунинг учун бандалар фақат унга қул бўладилар. Ҳеч вақтда бир қулга икки хўжайин бўлмайди. Шунинг учун инсонлар ўзларига ўхшаган инсонларга эмас, балки ягона Яратганга, ҳақиқий Маликка қул бўлишлари лозим.",
  },
  {
    arabic: "الْقُدُّوسُ",
    name: "ал-Қуддус",
    desc: "«Қуддус» – барча айблардан холи, нолойиқ сифатлардан муназзаҳ, мутлақ муқаддаслик ва мутлақ поклик Аллоҳнинг ўзигагина хосдир.",
  },
  {
    arabic: "السَّلاَمُ",
    name: "ас-Салом",
    desc: "«Салом» – барча нуқсонлардан саломат. Шунингдек, тинчлик, хотиржамлик ва роҳат берувчи дегани. Аллоҳ «Салом» сифати ила бандаларга тинчлик, омонлик, хотиржамлик ато қилади.",
  },
  {
    arabic: "الْمُؤْمِنُ",
    name: "ал-Муъмин",
    desc: "Муъмин – иймон ва омонликни берувчи.",
  },
  {
    arabic: "الْمُهَيْمِنُ",
    name: "ал-Муҳаймин",
    desc: "Ҳамма нарсани қамраб олувчи. Аллоҳ бандаларнинг барча ҳолатларига гувоҳ бўлиб туради. Ундан ҳеч нарса махфий қолмайди.",
  },
  {
    arabic: "الْعَزِيزُ",
    name: "ал-Азийз",
    desc: "Барчанинг устидан ғолиб. Ундан бирор нарса ғолиб келолмайди. Жамики азизлик маъноси Унинг учундир. Куч-қувват азизлиги ҳам Унинг учундир. Унга ғолиб келиб бўлмайди. Ман қилиш азизлиги ҳам Унинг учундир, У бунда бирор кишига муҳтож эмас. Қаҳр ва ғолиблик азизлиги ҳам Унинг учундир, бирор нарса Унинг изнисиз ҳаракат қила олмайди.",
  },
  {
    arabic: "الْجَبَّارُ",
    name: "ал-Жаббор",
    desc: "«Ал-Жаббор» сифатининг маъноси олий қадар улуғ Зот, ҳузурида ҳамма ўзини хор тутадиган Зот демакдир. У зот камбағалларни беҳожат қилади, ҳар бир қийналганни енгилликка чиқаради, мусибатга учраганларни сабот ва сабрга муваффақ қилади, агар мажбуриятларини адо қилишса, мусибат эвазига улкан ажрга мушарраф қилади. Синиқ қалблар у Зот сабабли тузалур. Дуодаги «Аллоҳумма ужбурний» сўзи банданинг ислоҳи ва унга зарар берувчи барча нарсани даф қилиш ҳақиқатидир.",
  },
  {
    arabic: "الْمُتَكَبِّر",
    name: "ал-Мутакаббир",
    desc: "«Мутакаббир» – кибриёси ва улуғлиги беҳад. Унинг олдида бошқалар қул бўлиб туради. У ҳар бир ёмонлик ва нуқсондан ҳамда бандаларига зулм қилишдан юқоридир. Ким У билан кибриёликда тортишса, қақшатқич зарба беради ва азоблайди.",
  },
  {
    arabic: "الْخَالِقُ",
    name: "ал-Холиқ",
    desc: "Асли ва ўхшаши йўқ нарсанинг ўлчовини мос қилиб яратувчи. Аллоҳ махлуқларни яратишдан олдин ҳам Холиқ деган васфга эга эди. У халойиқни халқ қилганидан кейин Холиқ исмини олгани йўқ. Холиқ мутлақ вужудга келтирувчидир.",
  },
  {
    arabic: "الْبَارِئُ",
    name: "ал-Бориъ",
    desc: "Йўқдан пайдо қилувчи, вужудга келтирувчи. Ал-Бориънинг вужудга келтиришида тафовут йўқдир.",
  },
  {
    arabic: "الْمُصَوِّرُ",
    name: "ал-Мусаввир",
    desc: "— Мусаввир – маҳлуқотларнинг суратини шакллантирувчи, ҳар бир нарсага ўзига хос сурат берувчи.",
  },
  {
    arabic: "الْغَفَّارُ",
    name: "ал-Ғаффор",
    desc: "Кўплаб мағфират қилиб, бандаларнинг айб ва гуноҳларини ўз фазли ила кечириб юборувчи.",
  },
  {
    arabic: "الْقَهَّارُ",
    name: "ал-Қаҳҳор",
    desc: "Барча махлуқотларни қабзасида тутиб, уларни ўз ҳукмига юритиб ва қудрати ила бўйсундириб турувчи.\nАллоҳ таоло Ўзининг ваҳдониятига далолат қилувчи оятларни туширганидан кейин ҳам уни инкор қилганларга ва халқига жабр қилганларга Ўзининг азиз султонлиги билан қаҳр қилади.",
  },
  {
    arabic: "الْوَهَّابُ",
    name: "ал-Ваҳҳоб",
    desc: "Неъматларни беҳисоб берувчи. Ваҳҳоб — ҳибаси, илтифоти, атоси кўп деган маънода. Араб тилида «фаъъол» сийғаси муболаға учун қўлланади. Аллоҳ таоло Ваҳҳобдир. Бандаларига Ўзининг буюк фазлидан ато қилади. Уларга неъматларни кетма-кет беради. Уларга тортиқларни мўл-кўл қилади. Ҳар бир нарсанинг хазинаси, осмону ер малакутлари, бутун ишларнинг жилови Аллоҳ таолонинг қўлидадир. Аллоҳ  мулкида хоҳлаганидек тасарруф қилади.",
  },
  {
    arabic: "الرَّزَّاقُ",
    name: "ар-Раззоқ",
    desc: "Кўплаб ризқ берувчи. Ризқларни ва уларнинг воситаларини яратувчи. Раззоқ махлуқотларига ҳеч бир оғирликсиз, қийинчиликсиз, ёрдам сўрамасдан ризқ берувчидир.",
  },
  {
    arabic: "الْفَتَّاحُ",
    name: "ал-Фаттоҳ",
    desc: "Кўплаб нарсаларни очувчи. Ўз раҳмати хазинасини бандаларга очувчи.",
  },
  {
    arabic: "اَلْعَلِيْمُ",
    name: "ал-Алийм",
    desc: "Ҳар бир нарсани билувчи. Бўлган ва бўладиган, аввалги ва охирги, зоҳир ва ботин нарсаларнинг барчасини билувчи.",
  },
  {
    arabic: "الْقَابِضُ",
    name: "ал-Қобиз",
    desc: "Руҳларни қабз қилувчи. Хоҳлаган кишисининг ризқини қабз қилувчи. Қалбларни қабз қилувчи (қабз – ушламоқ, тутмоқ).",
  },
  {
    arabic: "الْبَاسِطُ",
    name: "ал-Босит",
    desc: "Руҳларни кенгликка қўйиб юборувчи. Хоҳлаган кишисининг ризқини кенг қилиб қўювчи. Қалбларни кенг қилувчи.",
  },
  {
    arabic: "الْخَافِضُ",
    name: "ал-Хофиз",
    desc: "Пасайтирувчи. Мисол учун, кофир ва фосиқларнинг мартабасини уларни хору зор қилиб пасайтиради.",
  },
  {
    arabic: "الرَّافِعُ",
    name: "ар-Рофиъ",
    desc: "Кўтарувчи. Мисол учун, мўмин ва тақводорларнинг мартабасини азизу мукаррам қилиб кўтаради.",
  },
  {
    arabic: "الْمُعِزُّ",
    name: "ал-Муъизз",
    desc: "Азиз қилувчи. Кимни хоҳласа тўғри йўлга солиб азиз қилади.",
  },
  {
    arabic: "ٱلْمُذِلُّ",
    name: "ал-Музилл",
    desc: "Хор қилувчи. Кимни хоҳласа эгри йўлга юргани учун хор қилади.",
  },
  {
    arabic: "السَّمِيعُ",
    name: "ас-Самийъ",
    desc: "Ҳар бир нарсани эшитувчидир. У тилларнинг турли-туман бўлиши, ҳожатларнинг ҳар хил бўлишига қарамасдан овозларнинг ҳаммасини эшитадиган Зотдир. Унинг эшитишида махфий сўз билан очиқ сўз баробардир. Аллоҳ таолонинг эшитиши овозларнинг ҳаммасини қамраб олган. Унга овозлар аралашиб кетмайди. Уни овозлардан баъзисини эшитиши бошқасини эшитишдан чалғитмайди. Сўровларнинг турли-туман бўлиши Уни адаштириб юбормайди.",
  },
  {
    arabic: "الْحَكَمُ",
    name: "ал-Ҳакам",
    desc: "ал-Ҳакам, ал-Ҳикам ва ал-Ҳоким сўзлари бир хил маънода келади. \nБу буюк исм Аллоҳ таолога мукаммал ҳукм ва мукаммал ҳикматнинг собит эканлигига далолат қилади. Мукаммал ҳикмат Аллоҳ таоло учун яратишида, буйруқларида ва шариатида собитдирки, У Зот ҳар бир нарсани ўз жойига қўяди ва уларни ўз ўрнига туширади. Аллоҳ таолога нима учун деб бирор савол берилмайди. Аллоҳ таолонинг ҳикматига бирор оғиз сўз айтилиши мумкин эмас. Аллоҳ таолонинг мукаммалиги, ҳукм қилиши ёлғиз Ўзига хосдир. У бандалари ўртасида хоҳлаган нарсаси билан ҳукм қилади. Унинг ҳукмини қайтарувчи ва текширувчи йўқдир.\nАллоҳ таоло: «Ҳукм ёлғиз Аллоҳ таолоникидир».\n«У зот Ўз ҳукмида бирортани шерик қилмайди».\n«Аллоҳ таоло ҳукм қилади, Унинг ҳукмини текширувчи йўқ. У тез ҳисоб қилувчи Зотдир».",
  },
  {
    arabic: "الْبَصِيرُ",
    name: "ал-Басийр",
    desc: "Ҳар бир нарсани кўрувчи. Кўзга кўринадиган ҳамма нарсаларни кўрадиган, ҳамма нарсани гарчи у ўта майда ва кичик бўлса ҳам кўради. У зулматли кечада харсангтош устидаги ҳаракатланаётган қора чумолини ҳам кўради. У етти қават ернинг остидаги нарсаларни, худди етти қават осмоннинг устидаги нарсаларни кўргандек кўради. У қовоқларнинг, яъни киприкларнинг ҳаракатини ҳам, кўзларнинг хиёнатини ҳам кўради.",
  },
  {
    arabic: "الْعَدْلُ",
    name: "ал-Адл",
    desc: "Мутлақ адолат қилувчи. Аллоҳ таоло бандалари орасида, дунё ва охиратда адолат билан ҳукм қилади. Зарра мисқолича ҳеч кимга зулм қилмайди. Бирор кишига бошқа биров гуноҳини юкламайди. Банданинг гуноҳидан кўпроқ жазога тортмайди. Ҳақларни ўз эгаларига қайтариб ҳукм қилади.",
  },
  {
    arabic: "اللَّطِيفُ",
    name: "ал-Латийф",
    desc: "Латифнинг икки маъноси бор.\nБиринчиси – барча нарсаларнинг нозик ва дақиқ жойларигача билувчи. Яъни жуда ҳам нозик нарсаларни биладиган, ҳатто сирларни, қалблар ичидаги ва махфий нарсаларни билишидир.\nИккинчи маъноси – ўта лутф кўрсатувчи. Яъни бандаларига ва дўстларига турли манфаатларни Ўзининг лутфи ва эҳсони билан улар билмайдиган йўллар орқали етказишини англатади. Масалан, Юсуф алайҳиссаломнинг ҳолатлари, Мусо алайҳиссаломнинг ҳолатлари бунга мисол бўлади. Бу икки қиссада ҳам ишлар ўта махфийлик ва латифлик билан ривож топган ва охир-оқибат Аллоҳ таолонинг марҳамати мўмин бандаларига етган.",
  },
  {
    arabic: "الْخَبِيرُ",
    name: "ал-Хобийр",
    desc: "Ҳамма нарсадан ўта хабардор. Яъни Унинг илми махфий нарсаларни, сирларни ҳам, қалбларнинг ичида яширинган нарсаларни ҳам, донларнинг ичидаги махфий нарсаларни, зарраларни ҳам идрок қилган ҳамда нозик томонларини билиб, нафис ишлардан хабардор бўлган Зотдир. Бу исм ғоят нозик, нафис, ўта кичкина ва жуда ҳам махфий нарсаларни билишга боғлиқ.",
  },
  {
    arabic: "الْحَلِيمُ",
    name: "ал-Ҳалийм",
    desc: "Ғазаби қўзимайдиган ва иқоб қилишга шошилмайдиган деган маънодадир. У бандаларига ҳалим Зот. Аллоҳ таоло итоаткор бандаларига ибодат ва савобни кўпайтиришлари учун муҳлат қўяди. Гуноҳкор бандаларга эса шояд тоат-ибодат ва савоб амалларга қайтишлари учун ҳам муҳлат қўяди. Агар бандаларига жазони тезлаштирса, бирор киши иқобдан омон қолмайди. Лекин Аллоҳ таоло ҳалим, кечиримли ва муҳлат қўйиб, шошмайдиган сифатга эга Зотдир. Демак, ҳалимлиги сабаб кофирларни жазолашни кечиктиради. Фазли билан мўминларнинг савобини ҳам кечиктиради. Хулоса қилиб айтиладиган бўлса, ҳалим сифатига эга Зот азоб ва уқубатни кечиктиради ҳамда бандаларига гуноҳлари сабабли фазли ва инъомини тўхтатиб қўймайди. Балки итоаткорларга ризқ бергани каби, осийларга ҳам ризқ бераверади, гарчи ораларида ҳикмат тақозосига кўра фарқ бўлса ҳам.",
  },
  {
    arabic: "الْعَظِيمُ",
    name: "ал-Азийм",
    desc: "Ақл тасаввур қила олмайдиган даражада азаматли ва улуғ. Кибр, мутаккабирлик, яъни ҳаммадан ўзини катта тутиш ва буюклик Аллоҳ таолога хосдир.\nАгар ким «Мен каттаман», деб буюкликни даъво қилса, Аллоҳ таоло уни дўзахга киритади. Бандалар Аллоҳ таолонинг васфи бўлган Азаматнинг миқдори ва моҳиятини била олмайдилар. Мусулмон киши ҳар нарса ҳар қанча катта бўлмасин Аллоҳнинг азамати олдида кичкина бўлиб қолишини билиб, шунга иймон келтирса, Унинг олдида тавозеъли бўлади ҳамда ибодатнинг барча турларини Аллоҳ таолога хослаб бажаради, бу ибодатларга Унинг ёлғиз Ўзини ҳақдор деб эътиқод қилади.",
  },
  {
    arabic: "الْغَفُور",
    name: "ал-Ғофур",
    desc: "Кўп мағфират қилувчи.\nАл-Ғофир ва ал-Ғаффор ҳам шу маънодадир. Аммо ал-Ғофур муболаға учун ишлатилади. Ғофур сўзи сатр қилиб, тўсиш маъносини англатади. Аллоҳ томонидан мағфират қилиниши бандани азобдан тўсиш, деган маънодадир. Аллоҳнинг мағфирати сен билан азоб орасини тўсувчидир. Демак, банданинг хусусияти гуноҳ содир этиш, Аллоҳнинг шаъни эса уни кечиришдир. Гуноҳларни кечириш учун сенга истиғфор айтишни буюрган. Истиғфор айтишни буюриши инсонда заифлик ва ғафлат мавжудлигини билгани учундир. Мағфират қилиш (яъни гуноҳларни кечириш) инсониятдаги заифлик учун муолажадир. Агар Аллоҳ таолодан кечириш содир бўлмаса, гуноҳларимизни қандай йўқ қилардик, Роббимизга қайси юз билан йўлиқар эдик?!",
  },
  {
    arabic: "الشَّكُورُ",
    name: "аш-Шакур",
    desc: "Оз амал учун ҳам кўп савоб берувчи. \nАш-Шокир ва аш-Шакур сифатлари ҳам Аллоҳ таолонинг исмларидан бўлиб, амал қилувчи бандаларнинг саъй-ҳаракатини зое қилмай, кўплаб савоб берувчи демакдир. Балки бир неча баробарга кўпайтириб беради. Чунки Аллоҳ яхшилик қилувчиларнинг амалини йўқ қилиб юбормайди. Аллоҳ Ўзининг Китобида ва Расулининг суннатида битта яхшиликни ўн баробардан етти юз баробаргача кўпайтириб бериши ҳақида хабар қилган. Мана шу Аллоҳ томонидан бандалар учун шукр бўлади. У зот мўминларни Ўзининг розилиги учун муваффақ қилиб, кейин унинг шукрига, кўз кўриб, қулоқ эшитмаган ва инсон қалби ҳис этмаган яхшиликларни ато қилади. Бундай қилиш Унинг мажбурияти эмас эди. Буни фақат карами ва сахийлигидан ўзига шарт қилиб олди. Аллоҳ итоат қилганларга савоб бериши, гуноҳкорларни жазолаши шарт қилинмаган. Балки савоб бериши фазли-марҳаматидандир. Азоб бериши эса адолати ва ҳикматига биноандир.",
  },
  {
    arabic: "الْعَلِيُّ",
    name: "ал-Алий",
    desc: "Мартабаси олийликда бениҳоя.\nАллоҳ таоло зотининг олийлиги билан Алийдир. У зот аршга кўтарилган ва барча коинотларидан олий бўлган ва улардан ажрагандир.\nУ зот қадри улуғ бўлган Алий ва Олийдир. Аллоҳ таолонинг сифатлари Олий ва Буюкдир. Унинг сифатлари шу даражада буюк-ки, унинг сифатларига бировнинг сифати на яқин келади, на унга ўхшайди. Балки, Аллоҳ таолонинг сифатларидан биргина сифатни тўла қамраб, билиб, тушуниб етишга бандаларининг тоқатлари етмайди.\nУ бўйсиндириши олий бўлган, яъни қаҳри олий бўлган Алий ва Олийдир. Яъни, Аллоҳ таоло ҳамма нарсани бўйсундирган. Унга барча коинотлар таслим бўлган, итоат қилган, барча махлуқотларнинг тизгинлари унинг қўлида, улардан ҳар бири ҳаракатланса ҳам, тек турса ҳам, сукунат сақласа ҳам Аллоҳнинг изни билан қилади. Аллоҳ таоло хоҳлаган нарса бўлади, Аллоҳ хоҳламаган нарса бўлмайди.",
  },
  {
    arabic: "الْكَبِيرُ",
    name: "ал-Кабийр",
    desc: "Ҳар бир нарсадан катта.\nАллоҳ Алиюл-Кабийр бўлган зотдир. Яъни, зоти ва қадри ва қаҳри улуғ бўлган, ҳамма нарсадан катта бўлган зотдир. У учун кибриё сифат бўлган ва буюклик васф бўлган Зотдир. Аллоҳ таоло ҳадиси қудсийда:\n«Азизлик изорим, кибрлик эса ридоимдир (яъни бу икки сифат менга хосдир). Кимки менинг бу сифатларим устида мен билан талашса, уни азобимга гирифтор қиламан», деди. (Имом Муслим ривоятлари).\nКибр, мутаккабирлик, яъни ҳаммадан ўзини катта тушиш ва буюклик фақат Аллоҳ таолога хосдир.",
  },
  {
    arabic: "الْحَفِيظُ",
    name: "ал-Ҳафийз",
    desc: "Ҳар бир нарсани комил муҳофаза қилувчи.\nАллоҳ таоло «Менинг Роббим ҳар бир нарсани сақловчидир», деган.\nБу икки буюк исм, яъни ал-Ҳафийз ва ал-Ҳофиз сифатлари Аллоҳ таоло муҳофаза-сақлаш билан мавсуф эканлигига далолат қилади. Аллоҳ таолонинг бандаларини сақлаши икки турли бўлади:\nумумий ва хусусий.\nУмумий сақлаши. Аллоҳ таоло бандаларига таом, шароб ва ҳавони енгиллатиб, етиштириб бериш билан уларни манфаатлари, заруратлари ва ҳожатларига йўллаб қўйиш, улардан ёмонликлар, зарарлар, турли ёқимсиз нарсаларни даф қилиш билан сақлайди. Бу сақлашда яхши ҳам, ёмон ҳам, ҳайвонотлар ва бошқа нарсалар ҳам муштаракдир. Аллоҳ таоло Бани Одамни сақлашлари учун фаришталарни бириктириб қўйган. Яъни фаришталар ҳар қандай зарарларни Аллоҳнинг буйруғи билан улардан даф қилиб туришади.\nХос сақлаши. Бу билан Аллоҳ таоло юқоридаги сўзга қўшимча ўлароқ Ўз авлиёлари ва дўстларини сақлайди. Уларнинг иймонларини адаштирувчи шубҳалардан, фитналардан ва ҳалокатга олиб кетувчи шаҳватлардан сақлайди.",
  },
  {
    arabic: "المُقيِت",
    name: "ал-Муқийт",
    desc: "Барча моддий ва руҳий ризқларни яратувчи.\nМуқийт – кифоя қилувчи, сақловчи, ризқ ато қилувчи, насибасини берувчи, қодир бўлувчи маъноларида келади. Ушбу исм ана шуларнинг ҳаммасини ўзида мужассам қилган. Демак, У Зот бандаларнинг ҳолатларини ва улар муҳтож бўлган нарсани қамраб олгандир. У ҳамма нарсага қодир. Халқидан хоҳлаган кишининг қалбини илм ва иймон билан бойитган. \nАл-Муқийт – моддий ва маънавий ризқларни яратувчи, бандаларини озиқлантирувчи, парвариш этувчи Зот. Руҳга ва баданга қувват бўлувчи озуқаларни У яратган, шунингдек, борлиқдаги барча жонзотларнинг ризқларини ҳам ёлғиз Ўзи беради. У инсонларнинг ризқ-насиба топиш сабабларини ҳам яратиб, эҳтиёжларини таъмин этиш учун ҳаммани тўғри ва покиза сабабларга мурожаат этишга буюрган. Бундан ташқари, ал-Муқийт кўнгилларни тажаллий нурлари ила чароғон қилувчи, маънавий озуқа бахш этгувчи Зот демакдир.",
  },
  {
    arabic: "اﻟْﺣَسِيبُ",
    name: "ал-Ҳасийб",
    desc: "Кифоя қилувчи ва Қиёматда бандаларнинг ҳисобини қилувчи.\nАллоҳ мутлақ кифочидир. Ушбу сифатга фақат Аллоҳ лойиқдир. Қайси инсон бирор нарса тақдим қилса, яна бошқа нарсага муҳтож бўлиб тураверасан. Лекин Аллоҳ сен учун омонликни, ҳикмат ва илмни, соғлик ва саломатликни, оила неъматини, солиҳ фарзандларни, ҳожатингдан ортиқ нарсани, нафсий роҳатни, розиликни, фаровон ҳаёт тарзини, ёқимли моддий ҳаётни тақдим қилса, Унинг тақдим қилгани моддий ва маънавий жабҳаларнинг ҳар томонига кифоя қилади. Демак, бандалар Аллоҳга ёлвориб, Ундан ёрдам сўрашса ва Унга суянишса, албатта У зот кифоя қилур. Унинг кифоя бўлиши инсонларга ўхшаб баъзи қисмлар учун эмас, балки У Зот, ўша нарсанинг борлиғи, давомийлиги ва комиллиги билан кифоя қилувчидир.",
  },
  {
    arabic: "الْجَلِيلُ",
    name: "ал-Жалийл",
    desc: "Сифатларида улуғликка эга.\nМўминлар Аллоҳ лафзини ишлатишса одоб юзасидан «Аллоҳ жалла ва жалаалуҳу» ёки «Аллоҳ ъазза ва жалла» деб айтишади. Бунинг маъноси «Аллоҳ ҳамма нарсага қодир ва буюк», «Аллоҳ азиз ва буюк»0 деган маънодадир. Демак, ал-Жалийл дегани азизлик, беҳожатлик ва поклик деган маънони ҳам англатади.\nАл-Жалийл дегани «буюриш ва қайтаришга ҳақли бўлган Зот» дегани ҳамдир. У шундай улуғки, ҳар бир буюклик Унинг қаршисида арзимас ҳамда ҳар бир юксаклик Унинг қаршисида тубан эканини англатади.",
  },
  {
    arabic: "الْكَرِيمُ",
    name: "ал-Карийм",
    desc: "Биров сўрамаса ҳам, ҳеч бир эваз олмасдан, нарсаларни кўплаб ато қилувчи. Қарама-қаршиликлардан пок. Карамли ишлар ва хислатлар соҳиби.\nУшбу карамли ва саховатли деган сифат Аллоҳ азза ва жаллага собит васф эканига далолат қилмоқда. Карам лафзи бутун яхшиликлар ва мақтовли ишларни жамловчи сўз бўлиб, у билан қуруқдан-қуруқ беришнинг ўзи мақсад қилинмайди. Балки ундан беришнинг энг мукаммал маъноси тушунилади. Шунинг учун ҳам аҳли илмлар ушбу исм маъноси хусусида кўп сўзларни айтишган. Масалан, яхшилиги ва атоси кўп, хайр ва яхшилиги доимий, қадри улуғ, шаъни буюк, камчилик ва офатлардан пок, икром қилувчи, неъмат берувчи, марҳамат қилувчи, эвазсиз берадиган, сабабсиз берадиган, муҳтож бўлган-у муҳтож бўлмаган одамга берадиган, ваъда берса вафо қиладиган, катта бўлсин, кичик бўлсин – ҳожатларнинг ҳаммаси унга арз қилинадиган, унга тавассул қилиб боғланган одамни зое қилмайдиган, унга бош уриб борган одамни тарк қилиб қўймайдиган Зот дейилган. ",
  },
  {
    arabic: "الرَّقِيبُ",
    name: "ар-Роқийб",
    desc: "Ҳеч бир заррани ҳам қўймай текшириб турувчи.\nАгар мўмин банда ушбу исмга иймон келтирса, унинг иймонида, хулқи ва сийратида бунинг таъсири ўз асоратини очиқ-ойдин кўрсатади. Модомики, кузатилаётганингни ҳис қилсанг, бу ўзингни тўғрилаб, тартибга солиб олишинг чораси. Инсон ердан туриб ўзига ўхшаган инсон томонидан кузатилаётганини ҳис қилганда интизомли бўлиб қолади-ку, энди оламлар Робби томонидан кузатилаётганини ҳис қилса қандай бўлар экан?!\nАр-Роқийб – бандалар ҳолатини, уларнинг юз тутиб, орқа ўгиргани, ҳасад қилгани, ёмон кўриб, нафратлангани, соғлом ниятли бўлгани, бошқаларни яхши кўриши, бошқалардан ўзини баланд тутиши, бошқаларга ҳийла қилиш каби амалларини кузатиб туради. Демак, инсон бирор сўз гапирса, ичида бирор нарсани ўйласа ва бирор хатти-ҳаракат қилса, албатта уни кузатиб, билиб туради.",
  },
  {
    arabic: "ٱلْمُجِيبُ",
    name: "ал-Мужийб",
    desc: "Дуоларни ижобат қилувчи.\nАл-Мужийб сўраганнинг сўровини, дуо қилувчининг дуосини ижобат қилиб, мажбур бўлиб қолганнинг зарур нарсаларини ато қилади. Аллоҳ инсон ўз ҳожатини сўрашидан олдин буни билади. Лекин ўша киши Аллоҳга яқин эканини ҳис қилдириш учун сўрашга ундайди.\nАл-Мужийб Ўзининг дўстлари бўлмиш валийлардан ёмонликни аритади, яхши кўрганларидан балони кўтаради. Унинг ижобат қилиши сабабли катта бало ва улкан муаммолар бартараф бўлиб, ҳатто зарар беришни кутиб турган душманни ҳам йўқ қилиб юборади. Барча халойиқнинг Ундан сўрашга эҳтиёжи бор, Усиз ҳаёти бардавом бўлмайди.\nАл-Мужийб сўраганни ижобат қилади, дуо қилганни қабул айлайди ва изтиробга тушган киши нидо қилса, унга ёрдам беради.",
  },
  {
    arabic: "الْوَاسِعُ",
    name: "ал-Восиъ",
    desc: "Кенг – «ҳамма нарсани кенг илми ила иҳота қилган, барчани кенг раҳмати ила қамраб олган» маъносидадир.\nЯъни сифатлари, васфлари ва уларга тааллуқли бўлган нарсалар, бирор киши Унга лойиқ сано айта олмайдиган даражада кенг бўлган деган маънодадир. Аллоҳ таоло Ўзига қандай сано айтган бўлса шундайдир. У Зот азамати, салтанати, мулки, фазли ва эҳсони кенг, марҳамати ва карами буюк Зотдир.\nАгар одамлар камбағал бўлсалар, Аллоҳ таоло ўз фазли-марҳамати билан уларни беҳожат ва бой қилиб қўяди. Аллоҳ яхшилиги кўп ва фазли-карами буюк бўлган ал-Восиъ ва ал-Алийм зотдир.\nАллоҳ таоло бандаларига, динларида кенг қилиб қўйгани ва уларни тоқатлари етмайдиган нарсаларга буюрмагани ал-Восиъ исмининг шарофатидандир.",
  },
  {
    arabic: "الْحَكِيمُ",
    name: "ал-Ҳакийм",
    desc: "Ҳар бир нарсани ҳикмат ила қилувчи.\nАллоҳ таолонинг ал-Ҳакийм исми Қуръони каримда юзга яқин ўринда келган. \nАллоҳ таолонинг иккита исми бир ўринда келган пайтда бу ўзига хос маъно касб қилади. Масалан, «Азийзун-Ҳакийм» дейилса, Аллоҳ таоло куч-қудратли, лекин ҳаким Зотдир демакдир. Яъни куч-қудратли бўлиш билан бирга Ҳакийм ҳамдир. Аллоҳ таолонинг куч-қудратли бўлиши зулмга олиб бормайди. Балки Ҳакийм исми ва ҳикмат сифати билан Аллоҳ таоло бу куч-қудратини ўз ўрнига ишлатади.\nБу буюк исм Аллоҳ таолога нисбатан мукаммал ҳукм ва ҳикматнинг собит эканига ишорадир. Мукаммал ҳикмат Аллоҳ таоло учун яратишида, буйруқларида ва шариатида собитдирки, ҳар бир нарсани ўз жойига қўяди ва уларни ўз ўрнига туширади. Аллоҳ таолонинг ҳикматига таъна етказиб, бирор оғиз сўз айтилиши ҳам мумкин эмас. Аллоҳ таолонинг мукаммалиги ҳукм қилиш ёлғиз Унинг Ўзига хос эканидадир. У бандалари ўртасида хоҳлаган нарсаси билан ҳукм қилади. Унинг ҳукмини қайтарувчи ҳам, текширувчи ҳам йўқ.",
  },
  {
    arabic: "الْوَدُودُ",
    name: "ал-Вадуд",
    desc: "Барчага яхшиликни раво кўрувчи.\nАллоҳ таоло солиҳ бандаларига яхшиликни раво кўради, уларни севади, уларни Ўзига яқинлаштиради ва улардан рози бўлади. Аллоҳ таолонинг ал-Вадуд сифати «яхши кўрувчи, яқинлаштирувчи, эшитувчи ва ижобат қилувчи» деган маънони англатади. Ушбу исм Қуръони каримда икки ўринда келган.\n«Албатта, Роббим раҳмли ва шафқатли зотдир» (Ҳуд, 90).\n«Ва У мағфират қилувчи, муҳаббати зўр зотдир» (Буруж, 14).\nАгар банда ушбу исмнинг маъносини ҳақиқий маънода билса, унинг асорати ўша банданинг ақийдаси, тафаккури, сулуки ва ҳаётининг барча жабҳасида намоён бўлади. Аллоҳ бандаларига Вадуд, яъни яхшиликни раво кўришини ҳис қилгач, ҳаётини бахтли ўтказади, Аллоҳнинг барча махлуқотларига муҳаббат пайдо бўлади. Иймонда бўлмаганларнинг ҳидоят топишини, гуноҳ қилиб юрганларнинг тавба қилишини истайди. \nДемак, инсон учун нима бўйсундириб қўйилган бўлса, мана шу Аллоҳнинг ал-Вадуд сифати билан яхшиликни раво кўргани туфайлидир.",
  },
  {
    arabic: "الْمَجِيدُ",
    name: "ал-Мажийд",
    desc: "Шон-шарафи ва қадри беҳад юксак.\nал-Можид ва ал-Мажийд сўзлари «шараф, олийлик, юқорилик ва камолотнинг ниҳояси» деган маънони англатади.\nал-Мажийд исми Аллоҳ таоло ҳақида қўлланганда, камолот ва азизликнинг энг охирги даражаси тушунилади. Инсон камолотни яхши кўради. Шунинг учун инсон нафси фақат Аллоҳ маърифати билан тўлади, холос. Агар у Аллоҳдан бошқани танласа, изтиробда қолиб, роҳатни ҳис қилмайди. Инсон ҳаёти бир неча ҳолатларни босиб ўтади. Масалан, инсон мол-дунё йиғиб, мақсад қилган моддий нарсаларга эришиб бўлгач, кўз ўнгида унинг қадри тушиб, арзимас нарса бўлиб қолаверади. Аммо Аллоҳни қидирса, қидиришида ҳар қанча тер тўкса ҳам, бахтиёр ҳолда қолаверади. Чунки Аллоҳнинг охирига етиш имконсиздир. У Зот бениҳоя бўлиб, унинг комиллиги мутлақдир. \nКим Аллоҳнинг ал-Мажийд сифати билан хулқланса, барча ҳолатда сахий бўлиши лозим, мўмин кишининг бахил бўлиши асло мумкин эмас.",
  },
  {
    arabic: "الْبَاعِثُ",
    name: "ал-Боъис",
    desc: "Халқларга пайғамбарлар юборувчи. Кишиларга ҳиммат юборувчи. Ўликларни қайта тирилтирувчи.\nМасалан, инсон Аллоҳ томон бироз ҳаракатланса, Аллоҳ унинг ҳаракатига барака бериб, шижоатлантириб, қалбини очади ва тоат қилишига ёрдам беради. Агар инсон ботил йўлни ёки шаҳват йўлини ёки моддий йўлни ёки озор берувчи йўлни танласа, Аллоҳ ушбу қарордан узоқлашиши учун қандай ёрдам беради? Аллоҳ унинг кўксини худди осмонга кўтарилаётгандек, тор ва танг қилиб қўяди. «Кимни Аллоҳ ҳидоят қилмоқчи бўлса, унинг кўксини Исломга очиб қўяди. Кимни залолатга кетказишни ирода қилса, унинг кўксини худди осмонга кўтарилаётгандек тор ва танг қилиб қўяди» (Анъом, 125).\nАгар тўғри қарор қабул қилсанг, Аллоҳ қалбингни очиб қўйиш билан қарорингни амалга оширишга ёрдам беради. Агар хато қарор қабул қилсанг, Аллоҳ қалбингни тор ва танг қилиб қўяди. Бундан мақсад ёмон қарор қабул қилишингнинг олдини олишдир. Демак, бундаги боис қалбингни очиш ёки ёмонликдан тўхтатишдир.",
  },
  {
    arabic: "الشَّهِيدُ",
    name: "аш-Шаҳийд",
    desc: "Ҳар бир нарсага ҳозиру нозир. Барчага шоҳидлик берувчи.\nАш-Шаҳийд «махлуқотлари қаерда бўлса ҳам Аллоҳ таоло уларни кузатиб туради» деган маънодадир. Аллоҳ махлуқларига жон томиридан ҳам яқиндир. Аллоҳ махлуқотларини мукаммал иҳота қилиш билан шоҳиддир. Ўша комиллик билиш, кўриш, тадбир қилиш, қудрат орқали намоён бўлади. Агар ҳаракатлансанг, У Зот кўради. Агар гапирсанг, У Зот эшитади. Агар бирор нарсани қалбингда яширсанг, У Зот билиб туради. Агар қимирласанг, У Зот кўриб туради.\nАш-Шаҳийднинг «Аллоҳ таоло Ўзига танҳоликни ва адолатни гувоҳ қилган» деган маъноси ҳам бор.\n«Аллоҳ адолат ила туриб, албатта Ундан ўзга илоҳ йўқлигига шоҳидлик берди» (Оли Имрон, 18).",
  },
  {
    arabic: "الْحَقُ",
    name: "ал-Ҳаққ",
    desc: "Ўзгармас, собит Зот. Ҳақни юзага чиқарувчи.\nАллоҳ таоло ҳақ Унинг каломи ҳақ ваъдаси ҳақ ваъийди (дўзахдан қўрқитиши) ҳақдир. Аллоҳ таолонинг зоти, сифати ва феълида шак-шубҳа йўқдир, у ҳақиқатдир. Ушбу ҳақиқат атрофимиздаги нарсаларда ижро бўлувчидир. Масалан, Қуёш тонгда зуҳур бўлиши, кеча кундузга кириши, ер ёмғир билан ризқланиши ҳамда Унинг лутфу карами билан махлуқотларига иноят, Ўзининг дўстларига хос марҳамат, сабр қилувчилар, тақводорлар ва муҳсинлар билан бирга бўлиши ҳамда мазлумларга бироз фурсатдан кейин бўлса ҳам ёрдам бериши, синиб қолганларни тузатиши ва мажбур бўлиб қолганлардан зарарни кўтариши айни ҳақ ва ростдир. Ҳақнинг энг аввалги маъноси бор бўлишликдир. Унинг акси бўлмиш ботилнинг аввалги маъноси эса йўқликдир. Ваъданинг устидан чиқмаса, демак, унинг ваъдаси ботилдир. Шайтоннинг ваъдаси айни ботилдир. Гоҳида шайтон сени қўрқитади, ўша қўрқитиши ҳам ботилдир. Гоҳида камбағалликни ваъда қилади, ўша ваъдаси ҳам ботилдир. Аллоҳнинг ваъдаси эса айни ҳақиқатдир.",
  },
  {
    arabic: "الْوَكِيلُ",
    name: "ал-Вакийл",
    desc: "Барчанинг иши топширилган зот.\nАл-Вакийл – бандаларнинг ризқига ва ишларига вакил, деган маънодадир. Демак, бандаларнинг ҳар бир иши Аллоҳ таолога топширилган, ишларнинг барчаси У Зотга қайтувчидир. Масалан, инсон ҳаёти давомида кўплаб муаммо, хавф-хатар ва хасталикларга йўлиқади. Нима учун шундай? Бундаги ҳикмат банда Аллоҳни вакил қилиб, Унинг ҳузурига талпиниб, Унгагина суяниб, Унинг эшигини тақиллатиб, Унга муҳтож банда бўлиши учундир. Инсон Аллоҳни вакил қилгандагина ҳақиқий таваккулни амалга оширган бўлади. Ким Аллоҳга таваккул қилиш таъмини тотса, том маънодаги омонлик, хотиржамлик ва сукунатни қўлга киритади. Аллоҳ инсонни заиф қилиб яратган. Агар кучли қилиб яратганида у Аллоҳга таваккул қилмас, Унга илтижо қилмас ва итоат қилмас эди.  Демак, инсоннинг заиф яратилиши, фақат ва фақат ўзининг фойдасига бўлиб, барча ишларини энг кучли Зотга топшириб, таваккул қилади ва У Зотни вакил қилади.",
  },
  {
    arabic: "الْقَوِيُ",
    name: "ал-Қовийй",
    desc: "Ўта кучли ва қувватли зот.\nАл-Қовийй – мукаммал куч соҳиби. У ҳар бир нарсага қодирки, ҳар қандай ҳолатда ҳам Унга ожизлик ҳукмрон бўлмайди. У шу даражада қувват эгасики, Унинг азамати олдида барча куч йўқ бўлиб кетади. \nАл-Қовийй – ғолиб бўлиб, мағлуб бўлмайди; паноҳ сўралиб, Унга талпинилади. \nСен мана шундай кучли Зот билан бирга бўлсанг-у, бирор кишидан қўрқишга ҳақинг борми? Модомики, сен Аллоҳ билан бирга экансан, сенга ким ҳам бас кела олар эди? Аллоҳ сенга қарши экан, сенинг ёнингда ким ҳам тура олар эди? \nЭй Робб! Сени топган киши нима йўқотибди, Сени йўқотган киши нимани ҳам топибди!\n«Улар Аллоҳнинг ҳақиқий қадри-улуғлигини билмадилар. Дарҳақиқат, Аллоҳ кучли-қудратлидир» (Ҳаж, 74).",
  },
  {
    arabic: "الْمَتِينُ",
    name: "ал-Матийн",
    desc: "Қувватида мустаҳкам ва матонатли Зот.\nГоҳида тўсатдан куч келади, ана шу куч йўқ бўлувчидир. Аммо мустаҳкам, метин ва абадий бўлган куч ал-Матийн дейилади.\nАл-Матийн сўзини Аллоҳ таоло учун ишлатсак, мукаммал куч-қувват деган маънода ишлатамиз. Аллоҳнинг кучи таъсир ўтказувчидир, таъсирланувчи эмас. Мукаммал қувват деганда Унинг қудрати энг юқори даражада бўлиб, уни ер ва осмонда бирор нарса ожиз қолдирмайди. Унинг кучи қайси макон ва замонда бўлса ҳам, бардавом бўлувчидир. Эй инсон, агар сен ал-Матийн сифатли Аллоҳ билан бирга бўлсанг, куч-қувватни ҳис қиласан ва бирор киши сенга зарар бера олмайди. Сен ўзингни Аллоҳнинг муҳофазаси, риояси ва ҳимоясида эканингни идрок қиласан.",
  },
  {
    arabic: "الْوَلِيُّ",
    name: "ал-Валийй",
    desc: "Муҳаббат қилувчи, нусрат берувчи ва халқининг ишини юритувчи Зот.\nАл-Валий луғатда душманнинг аксидир. Бу исм Аллоҳ таолога нисбатан ишлатилганда, бутун олам ва халойиқнинг ишларини юритувчи, дўстларига ёрдам берувчи, эҳсон ва фазли билан илҳомлантирувчи ҳамда муҳаббат қилувчи демакдир. \nАллоҳ таоло бандаларига валий бўлиши уларга жон томиридан ҳам яқин бўлишидир.\nУмумий валийлик иноят, тадбир ва ишларни тасарруф қилишни англатади.\nХос валийлик мўминларга дўст бўлиб, уларга яқин бўлишни англатади. Яъни муҳофаза қилиш, муҳаббат қилиш ва ғалаба ато қилиш дегани. Аллоҳ бу ҳақда «Огоҳ бўлингким, Аллоҳнинг валийлариь (яъни дўстларига) хавф йўқдир ва улар хафа ҳам бўлмаслар» (Юнус, 63), деб айтган.",
  },
  {
    arabic: "الْحَمِيدُ",
    name: "ал-Ҳамийд",
    desc: "Барча мақтовлар ила мақталган зот./nАл-Ҳамийд сўзи Қуръони каримнинг 17 жойида келган. Ал-Ҳамд сўзи 40дан кўпроқ ўринда келган. Ҳамдларнинг барчаси Аллоҳ учундир. У сифатлари, феъллари, қадарларининг барчасида мақтовлидир. Ҳамд мақтовларнинг энг улкани ва энг кенгидир. Ҳамд икки турли бўлади:\n1. Аллоҳ берган неъматларига ҳамд айтиш. Яъни бандаларига нисбатан қилган яхшиликка Аллоҳга шукр қилиш.\n2. Аллоҳ таоло ўзига нисбат бериб айтган ҳамд.\nИмом Ғаззолий «Ал-Ҳамийд мақталган деганидир. Аллоҳ таоло ўзига халойиқни яратишдан олдин азалда ҳамдни нисбат қилган. Халойиқни яратгач, халқи Унга ҳамд айтди», дедилар.\nАллоҳга ҳамд бўлсин, чунки У Зот ризқ, ақл, мол-дунё, оила, соғлик, омонлик ва Ислом неъматини ато қилди. Ким Роббини ал-Ҳамийд сифати билан таниса, Роббига ҳамд ва сано айтиш билан кифояланиб, одамларнинг мақтовига муҳтож бўлмайди. Агар ҳамд айтиш нафсинг қаъридан отилиб чиқмаса, тилинг Аллоҳга сано айтишга қизиқмаса, сен тўла маънодаги мўмин бўла олмайсан. ",
  },
  {
    arabic: "الْمُحْصِي",
    name: "ал-Муҳсий",
    desc: "Барча нарсанинг ҳисобини олувчи зот.\nАл-Муҳсий – барча нарсани батафсил ҳолда қамровчи бўлиб, ерда ҳам, осмонда ҳам Унга бирор нарса махфий бўлмайди.\nАл-Муҳсий – зоҳирда олган нафасингни, ботинда ҳис-туйғуларингнинг ҳисобини олади.\nАл-Муҳсий – тоат-ибодатларинг сонини сақлаб, жамики ҳолатингдан хабардор. Аллоҳ таоло амалларингни сарҳисоб қилиб, йўлиқиш кунига тайёрлаб қўяди. Масалан, инсон неча кун яшаган, қанча пайт сайр қилган, қанча сўз гапирганини санаб, адоғига етишнинг имкони йўқ. Лекин Аллоҳ таоло барча амалларингни нозик жиҳати, тафсилоти, муносабати, туртки бўлган сабаби ва мақсадини билади. Сен қиёмат куни кўрадиган барча нарсаларинг Аллоҳ ҳисоблаб қўйган нарсасидир.\nАл-Муҳсий – ишларнинг нозик жиҳатини ҳисобга олувчи, сирларини билувчи, зоҳирини кўрувчи ва ботинидан хабардор Зот. У Зот тоат-ибодатни, халойиқнинг олган нафасини ҳисоблаб, яширган нарсаларидан хабардор бўлиб, жамики мавжудотни, унинг ҳаракатланишини, сонини ва ҳолатини билувчидир.",
  },
  {
    arabic: "الْمُبْدِئُ",
    name: "ал-Мубдиъ",
    desc: "Барча нарсаларни аввалбошдан бор қилган Зот.\nАл-Мубдиъ «нарсаларни олдинги намуналарига қарамасдан йўқдан бор қилувчи» деганидир. Аммо инсон бирор нарсани ихтиро қилса, ўша нарсанинг аслидан кўчирма қилиши аниқ. Масалан, ғаввосликни денгиз остидаги балиқларни кўриб ихтиро қилган. Муҳандис ҳам бинонинг қуришидан олдин зеҳнида уч ёки тўрт хилдаги намуна айланади. Лекин Аллоҳ таоло коинотни яратганида ҳеч қандай намунага мурожаат қилмай, йўқдан борлиқни яратган. \nБаъзи орифлар «Ал-Мубдиъ – бандасининг қалбига нурни жўнатган ва у нур сабабли қалби нурафшон бўлган» деб айтишган. Чунки ўша инсон нур берилишидан олдин дангаса, ялқов бўлиб, ном-нишонсиз кимса эди. Аллоҳ унинг қалбига йўқ жойдан нур сочгач, у энди номаълум шахсдан ҳурматли кимсага айланган.",
  },
  {
    arabic: "ٱلْمُعِيدُ",
    name: "ал-Муъийд",
    desc: "Йўқ бўлган нарсаларни яна қайтадан бор қилувчи.\nАл-Муъийд – халойиқни ҳаётдан кейин ўлимга қайтаради. Ўлим, ҳар бир тирик жонзотнинг ниҳоясидир. Сўнгра ўлимдан кейин ҳақиқий ҳаёт келади. Демак, дунёдаги ўлим охиратдаги ҳақиқий ҳаётнинг ибтидоси, яъни бошланишидир. \nАл-Муъийд «ҳисоб қилиш учун халойиқни қайтадан тирилтириш» дегани ҳамдир. Чунки қайта тирилишда савол-жавоб, ҳисоб-китоб, амалларнинг намойиш қилиниши бор. Қайтарувчи Зот ҳар бир махлуқни амали, сўзи ва ато қилган неъматлари хусусида сўроққа тутади.\nИнсон жисми майда зарраларга бўлиниб, фаноликка юз тутади. Ана шу зарраларнинг айни ўзи йиғилиб, янгидан халқ қилинади. Агар инсон ҳиндлардаги каби ёқилиб, унинг кулини кенглик ёки денгизга сочиб юборилса ҳам, Аллоҳ таоло уни қайтадан тирилтиради. \n«Сен «Уларни илк марта йўқдан бор қилган зот тирилтирур ва у ҳар бир яратилган нарсани яхши билгувчидир», деб айт» (Ёсин, 79).",
  },
  {
    arabic: "الْمُحْيِي",
    name: "ал-Муҳйи",
    desc: "Тирилтирувчи. У зот ўликларни тирилтирувчидир. Бу исмга махлуқларни қайта тирилтиришдан олдин ҳам сазовордир. Аллоҳ ўликларга жон киритиб, тирилтирганидан кейин тирилтирувчи, деб аталганидек, уларни халқ қилишдан олдин, ҳаёт беришидан олдин ҳам тирилтирувчи дейилаверади. Худди халойиқни халқ қилишдан олдин Холиқ бўлганидек. Аллоҳ қиёмат куни ўликларни тирилтиради, шунинг учун Тирилтирувчи номи берилди. Бас, тирилтириш сифати Аллоҳ таолода махлуқларни тирилтиришдан олдин ҳам собит.\nАллоҳ халойиқни икки марта яратади. \n«Эй Роббимиз, Сен бизни икки марта ўлдирдинг, икки марта тирилтирдинг» Ғофир-11.\nДемак, 1-сида йўқдан бор қилиб тирилтиради.\n2-сида ўлгандан кейин тирилтиради.\n3-бир тирилтириш ҳам бўлиб, Аллоҳ ўлиб қолган қалбни тирилтиради. Мўмин киши Қуръон ўқиса, кўзидан ёш оқади, жасадини титроқ тутиб, қалби ҳаяжонга келади, Роббига итоат қилишни яхши кўради, ҳақ нарсага қулоқ тутиб, ҳақни сўзлайди, Аллоҳни зикр қилади, Аллоҳнинг розилиги учун саъй-ҳаракат қилади.",
  },
  {
    arabic: "اَلْمُمِيتُ",
    name: "ал-Мумийт",
    desc: "Ўлдирувчи. Барча жонзотларнинг жонини олувчи.\n«Мени ўлдирадиган, сўнгра тирилтирадиган ҳам Унинг Ўзи» (Шуаро, 81).\nБирор киши бирор инсонни ўлдириши ёки бирор ўликни тирилтириши мумкин эмас. Агар бир киши «Мен қатл этиш орқали ўлдираман», деб айтса, биз унга «Ўлдириш қатлсиз бўлади, ўлим гавда тузилишига зарар бермаган ҳолда амалга ошади. Аммо сен амалга оширган қатл жасадга нуқсон етказади», деб айтамиз. \nБорлиқда Аллоҳдан бошқа бирор нарса ҳаётга нуқта қўйиб, ўлдиришга журъат қила олмайди, деб қатъий эътиқодда бўлмоғимиз шарт. Аллоҳ чегаралаб, тақдир қилганидан бошқасида инсон вафот қилмайди. ",
  },
  {
    arabic: "الْحَيُّ",
    name: "ал-Ҳайй",
    desc: "Тирик. У ҳамиша тирикдир, У ўлмайди. Яъни Аллоҳнинг ҳаёти абадийдир, ўлим ила йўқ бўлмас. Шунингдек, Аллоҳнинг ҳаёти азалий, олдин йўқ бўлган эмас. Ягона Аллоҳнинг тириклиги ўзигагина хос алоҳида ҳаёт бўлиб, бандалар ҳаётига ўхшаш бошқа масдардан берилган эмас. Бу ҳаёт азалий ва абадийдир. Ибтидоси ҳам, интиҳоси ҳам йўқ. Аллоҳнинг тириклиги ҳеч бир жиҳатда бандаларнинг ҳаётига ўхшамайди.\nАллоҳнинг ал-Ҳайй сифати боқий қолувчи ва барҳаёт деганидир. Агар Аллоҳ ҳаёт десак, Уни доим барҳаёт эканини англаймиз. Агар фалончи ҳаёт десак, уни вақтинча тирик эканини англаймиз. Аллоҳнинг ал-Ҳайй сифати Ўзининг зотидаги боқий тирикликдир. У Зотга ўхшаш ҳеч нарса йўқдир. Аммо махлуқотнинг тириклиги ўз зотида бўлмай, балки Аллоҳнинг ёрдамига муҳтождир. Агар Аллоҳ ёрдамини узиб қўйса, махлуқот жонсиз мурдага айланади. Махлуқ мингга яқин сабаблар билан тирик туради. Агар Аллоҳ бирортасини ишлатмай қўйса, масалан, юракни тўхтатиб қўйса, ҳаёти барҳам топади.",
  },
  {
    arabic: "الْقَيُّومُ",
    name: "ал-Қоййум",
    desc: "Ўзи қоим бўлган ва бошқаларни қоим қилган зот. Аллоҳнинг «қоййум»лик сифати маъноси Аллоҳ таборака ва таолонинг ҳар бир нарса устида турувчи экани ва ҳар бир турувчи нарса Унинг сабабидангина туришини англатади. Шу билан Аллоҳнинг қоимлиги бошқаникига ўхшамайди ва доимийдир.\nАл-Қоййум деб бошқарувчига айтилади. Аллоҳ таоло Ўзини ҳамда махлуқотларини ҳам бошқаради. Бизлар барчамиз Аллоҳ таолонинг бошқаруви остидамиз. Аллоҳ бизга ҳаёт бериб, бошқариб туради. Жигар шу даражадаги жумбоқ аъзоки, унинг ўзига беш минг вазифа юклатилган. Агар Аллоҳ ундан қўллаб-қувватлашни узиб қўйса, худди бозорларда сотилаётган ҳайвоннинг жигарига ўхшаш тўқима, гўштсимон нарсага айланиб қолади. Кўз, қулоқ, тил, юрак, ўпкалар ҳам Аллоҳ таолонинг бошқаруви асосида ишлаб туради. Агар Аллоҳ қўллаб-қувватлашини тўхтатса, худди ҳайвонларнинг кўз ва қулоғига ўхшаб ахлатга ташлаб юборилади.",
  },
  {
    arabic: "الْوَاجِدُ",
    name: "ал-Вожид",
    desc: "Топувчи. Хоҳлаган нарсасини топувчи. Бу ишда биров Уни тўса олмайди.\nГоҳида инсон заифлиги учун «Фалон нарсани қидирдим, аммо топа олмадим», деб айтади. Лекин Аллоҳ ал-Вожид сифати билан барча нарсани топувчидир, Ундан бирор нарса кетиб қолмайди. У барча талаб қилган ва хоҳлаган нарсаларини топувчидир. Инсон бирор сифат билан сифатланса, у нисбийдир. Лекин Аллоҳ бирор сифат билан сифатланса, у мутлақдир.\nМавжудлик йўқликнинг хилофидир. Роббимиз «вожибул вужуд», яъни азалий ва абадийдир. Аллоҳ таолодан бошқалар эса 1мумкинул вужуд», яъни олдин йўқлик бўлиб, яна йўқлик билан тугайди, деганидир. Аллоҳ таоло ал-Қодийм ва ал-Боқий бўлиб, Ундан олдин ҳам, Ундан кейин ҳам ҳеч нарса бўлмаган. \nАл-Вожид «ночор бўлиб қолмайдиган, беҳожат» деган маънода ҳам келади.",
  },
  {
    arabic: "الْمَاجِدُ",
    name: "ал-Можид",
    desc: "Улуғлик ва шараф соҳиби.\nБиз юқорида Аллоҳ таолонинг ал-Мажийд сифатини «шон-шарафи ва қадри беҳад юксак» деб ўргандик.\nАл-Мажийд сўзи муболаға учун ишлатилади. Яъни беҳад улуғ ва ўта шарафли деган маънода келди.\nАл-Можид сифати Қуръони каримда зикр қилинмаган, балки ҳадисда келган. Аммо ал-Мажийд сифати Қуръони каримда зикр қилинган. \nАл-Можид сўзи шараф, олийлик, юқорилик ва камолот деган маънони англатади.\nАл-Можид «карами кенг ва беҳожат» деган маънода ҳам келади. Демак, Аллоҳни карами кенг, беҳожат, шон-шарафи ва қадри юксак ва нарсаларни ато қилувчи Зот эканини билсанг, сен ҳам ушбу сифат билан хулқланиб, ушбу сифатдаги насибангни олиш учун халойиқни кечирувчи, уларга мулойим, уларни афв қилувчи, камбағалларга мол-мулкингни инфоқ қилувчи кимса бўлмоғинг лозим.",
  },
  {
    arabic: "الْواحِدُ",
    name: "ал-Воҳид",
    desc: "Ягона, битта. У Зот зотида ҳам, сифатларида, ишларида ҳам ягонадир.\nТавҳид сўзи мана шу «ал-Воҳид» сўзидан олинган. Ҳар-бир мўмин биладики, банданинг таълим оладиган нарсаларининг энг афзали бу тавҳиддир. Тавҳид, илмнинг ниҳоясидир. Жамики пайғамбарлар даъватларининг мазмун ва моҳияти айнан тавҳиддир. Тавҳид бу дин деганидир.\nСен ўзингда безовталик ва изтиробни кўрсанг, демак, сенда тавҳид тушунчаси заифлашиб қолган бўлади. Чунки бундай тушкунлик келажагинг ва ризқинг ўзингга ўхшаган инсонларнинг қўлида, деб фикрлашинг натижасида юзага келган. Сен раҳм қилувчиларнинг энг раҳмлиси бўлган ягона Зот Аллоҳнинг ҳимоясида эканингни билсанг, хотиржамлик ва сукунат томон қадам қўясан.\nТавҳид – фикрингга келган ҳар қандай нарсада Аллоҳ таоло унинг хилофи, дейишдадир.\nТавҳид – Аллоҳ зоти, сифатлари ва амалларида ягона, деган манодадир.\nБаъзи орифлар «Ал-Воҳид сени барчадан Ўзи кифоя қилади, барча сени ал-Воҳиддан кифоя қила олмайди», деб айтишган.",
  },
  {
    arabic: "الصَّمَدُ",
    name: "ас-Сомад",
    desc: "Ас-Сомад сифати кўп маъноларни ўз ичига олади:\n– итоат қилинган, улуғ саййид, Усиз ҳеч бир иш битмайди;\n– ҳеч кимга ҳожати тушмайди, барчанинг ҳожати Унга тушади;\n– бутун махлуқот битиб тугаса ҳам, Ўзи доим боқийдир;\n– қорни йўқ деган маънода ҳам келади. Чунки Аллоҳ инсонга хос бўлган ейиш ва ичиш каби нарсалардан йироқ Зотдир.\n– Қийинчилик пайтида қасд қилинадиган Зот. \nАс-Сомад деганда, махлуқотлари Унга юзланадиган ва барча ишларида Уни қасд қиладиган, диний ва дунёвий ишларини ислоҳ қилишда Унга мурожаат қиладиган, балолар ва ташвишлар келган пайтда Унинг олдига бош уриб борадиган, кулфат ва ғам-ғуссалар етган пайтда Унга ёлворадиган, қийинчилик ва машаққатлар етган пайтда мадад сўраш учун Аллоҳдан бошқа қасд қиладиган бирор Зот йўқдир.\nАс-Сомад маъносини яхши тушунган банда ўзида куч-қувват, азизлик ва Аллоҳдан бошқага суянмасликни қўлга киритади. ",
  },
  {
    arabic: "الْقَادِرُ",
    name: "ал-Қодир",
    desc: "Чексиз қудрат соҳиби. У Зот ҳар бир нарсага қодирдир. Ҳар бир иш унга осондир. Аллоҳ таоло азалдан ҳар бир нарсага қодирдир. Агар азалдан қодир бўлмаса, қачон ва қандоқ қилиб, ҳар бир нарсага қодир бўла олади.\nАл-Қодийр, ал-Муқтадир ҳам ал-Қодир сифати каби бўлиб, бир-биридан хусусияти афзаллиги билан фарқланади.\nАллоҳнинг қудрати мукаммалдир, У Зот қудрати билан мавжудотни йўқдан бор қилган, қудрати билан уларнинг ишининг тадбирини қилган. У қудрати билан тирилтиради ва ўлдиради ҳамда яхшилик қилганларни мукофотлаб, ёмонлик қилганларни жазолайди. Агар бирор нарсани хоҳлаб қолса, «Бўл» деса, у нарса воқеликда пайдо бўлади. У қудрати билан қалбларни хоҳлаган томон буради. Сен Аллоҳнинг буйруқларини муҳофаза қилиб, қайтариқларидан қайтсанг, Аллоҳ ҳам сени муҳофаза қилади. \nДемак, Аллоҳнинг ал-Қодир сифатини яхши тушуниб, у билан одобланган киши доим Аллоҳ билан бирга эканини ҳис қилади. Аллоҳнинг буйруқларига оғишмай амал қилади. Агар сўрайдиган бўлса, фақат Аллоҳдан сўрайди.",
  },
  {
    arabic: "الْمُقْتَدِرُ",
    name: "ал-Муқтадир",
    desc: "Жуда ҳам қудратли.\nАл-Муқтадир сифати ал-Қодийр ва ал-Қодир сифатларидан ҳам муболағалироқ. \nАл-Муқтадир – Аллоҳ қудратни насиба қилиб берган ҳар қандай нарса устидан ҳукмрон, деганидир.\nАл-Муқтадир фақат заифларнинг устидан ҳукмрон эмас, балки ўта кучлилар устидан ҳам ҳукмрон, деганидир.\nАл-Муқтадир илми билан нарсаларни ўлчаб, қудрати билан амалга оширади. Унинг илми ва қудрати мутлақдир.\nАл-Муқтадир сифати ал-Қодийр ва ал-Қодир сифатларини биргаликда ўз ичига олади.\nАллоҳнинг ал-Қодир исми ўлчовларни ўз илми билан ўлчовчи, деганидир. Аллоҳ ҳар бир нарсани ясаши ва яратишидан олдин тақдир қилади.\nАллоҳнинг ал-Қодийр исми эса олдинги илмига мувофиқ мутлақ қудрати билан яратишидир. \nДемак ал-Муқтадир исми – олдинги қатъий, мутлақ, комил, кучли қудрат режасини мутлақ амалга ошиши, деган маънодадир.",
  },
  {
    arabic: "الْمُقَدِّمُ",
    name: "ал-Муқаддим",
    desc: "Олдинга сурувчи. У зот хоҳлаган шахс ва нарсани хоҳлаган шахс ва нарсасидан олдинга суради.\nУшбу исм Қуръонда зикр қилинмаган. У имом Бухорий, Муслим ва Ибн Хузаймалар ривоят қилган ҳадисда келган. \nАгар Аллоҳ таолони ал-Муқаддим десак, У Зот Ўзининг хоҳиш ирода ва ҳикматига мувофиқ олдинга суради, деган маънони англатади. Масалан, баъзиларни баъзилардан олдин вафот эттиради. Ёки ҳикматига биноан мусибатга учратишда бир пайғамбарни бошқасидан, бир саҳобийни бошқа саҳобийдан, бир мўминни бошқасидан олдинга суради. \n«Ҳар бир умматнинг ажали бор. Ажаллари келган вақтида бирор соатга орқага ҳам, олдинга ҳам сура олмаслар» (Аъроф, 34).\nДемак сен ушбу исмнинг маъносини идрок қилиб, ҳаётинг Аллоҳ қўлида эканига ва ҳаётинг муддати олдинга ҳам, ортга ҳам сурилмаслигига қатъий равишда иймон келтирсанг, нафсинг шод, ўзинг шижоатли бўласан ва бирор инсон қаршисида хор бўлиб, бўйин эгмасдан азизу мукаррам бўлиб яшайсан.",
  },
  {
    arabic: "الْمُؤَخِّرُ",
    name: "ал-Муаххир",
    desc: "Орқага сурувчи. У зот хоҳлаган шахс ва нарсани хоҳлаган шахс ва нарсасидан орқага суради.\nал-Муаххир луғатда ал-Муқаддамнинг акси бўлиб, ортга суриш деган маънодадир. Бандалар тавба қилиши учун уларни раҳмати ва ҳикматига биноан азоблашни кечга суради. Аллоҳ шу даражада ҳалим зотки, инсон гуноҳ қилса, тавба қилиб олиши учун унга фурсат беради. Умар розияллоҳу анҳу бир ўғрини азоблашни хоҳлаганларида, ўғри: «Аллоҳга қасам, бу 1-марта ўғрилик қилишим», деди. Шунда Умар розияллоҳу анҳу: «Ёлғон гапирдинг, Аллоҳ 1-марта гуноҳ қилганингни ошкора этмайди. У зот Ҳалим бўлгани учун ошкора қилишни кечиктиради, сен бундан олдин ҳам ўғирлик қилгансан», дедилар. Ҳақиқатда, инсон бирор гуноҳни содир қилиб, унга муккасидан кетса ва тавба қилмаса, ўша содир қилган гуноҳи билан фахрланса, азоби тезлик билан келади. Аммо бирор гуноҳ содир қилса, Аллоҳ муҳлат беради. Ўша гуноҳкор қилган гуноҳига пушаймон бўлса, ўша пушаймонлиги ҳам тавбадир. Агар гуноҳдан тўла чекинса, у ҳам тавба ўрнидадир.",
  },
  {
    arabic: "الأوَّلُ",
    name: "ал-Аввал",
    desc: "У ҳамма нарсадан аввал, яъни барча мавжудотлар йўқлигида бор эди. Мавжудотларни «Аввал» сифатига эга бўлган Аллоҳ яратди. Яъни Аллоҳнинг вужудга келишининг бошланиши йўқдир.\nАллоҳ аввалдир, чунки Ундан аввал борлиқда бирор нарса бўлмаган. У зоти ва шаъни билан барча нарсадан олдин келгани билан олийдир. У бирор нарсада бошқага муҳтож бўлмайди. Унга барча нарса барча ишда муҳтождир. Шундай экан сен ҳамма нарсада Аввал бўлган Зот билан бирга бўл, кучсиз махлуқ билан эмас, балки кучлиларнинг кучлиси билан бирга бўл. Сен бой бўлиб кўринган киши билан эмас, бойларнинг бойи бўлган Зот билан бирга бўл. Илмни даъво қилувчи инсон билан бирга эмас, балки мутлақ илм эгаси бўлган Зот Аллоҳ таоло билан бирга бўл. Сен гўзал билан эмас, гўзалликни ато қилувчи Зот билан бирга бўл. \nАл-Аввал дегани бошқаси унга бориб тақалади ёки натижага эришишдаги асосий бошланиш нуқта, деганидир. Яъни Аллоҳ таоло барча нарсанинг аввалги сабабчисидир.",
  },
  {
    arabic: "الآخِرُ",
    name: "ал-Охир",
    desc: "Ҳамма нарса йўқ бўлиб кетганда ҳам, Унинг Ўзи қолади. \nАллоҳ ал-Охирдир. У Зот доим мазлум билан биргадир. Гоҳида эр хотинига зулм қилиб ўзбошимчалик билан талоқ беради. Аллоҳ таоло бу солиҳа аёлга икром кўрсатиб, аввалги эрини унуттиради-да, ундан ўч олиш учун иккинчи солиҳ эрни насиб қилади. Демак, Аллоҳ охирги ҳукмни Ўзи ўқийди. Гоҳида тўнғич ўғил отадан қолган барча мол-дунёни укаларига бермасдан тортиб олади. Аллоҳ ал-Охир сифати билан укаларнинг ишларига муваффақият ортидан муваффақият бериб, аканинг ишини хароб қилади. Оқибатда, ака укаларнинг қўлида ишлашга мажбур бўлади. Демак, охирги ҳукмни Аллоҳ Ўзи ўқийди. Аллоҳ таоло бу ҳақда: «Ёки улар бирон ишга қарор қилдиларми? Бас, Биз албатта қарор қилгувчимиз» (Зухруф, 79), деб айтган. \nАллоҳни танимаган инсон Аллоҳдан қўрқмайди. Масалан, икки ёшли болакайнинг олдига илон қўйилса, у илондан қўрқмайди. Чунки унинг хавфини ҳис қилмайди. Агар ҳис қилганида қўрқар эди.",
  },
  {
    arabic: "الظَّاهِرُ",
    name: "аз-Зоҳир",
    desc: "Унинг мавжудлиги ошкор, очиқ-ойдиндир. У ҳамма нарсадан зоҳир-устундир.\nАгар биз Аллоҳ таоло аз-Зоҳир деб айтсак, У Зотнинг олийлиги, ғолиблиги ва шаънининг юксаклигида барчадан устундир, деб тушунамиз. У Зот комилликнинг барча маъносида ғолибдир. Унинг илми барча нарсани зоҳирда ҳам, ботинда ҳам қамраб олувчидир. У зот шу даражада зоҳирки, унинг сифатлари орқали ақлий далил билан танилади. Масалан, инсон китнинг қорнига тушганда юз фоиз умидсизликка тушиб қолади. Кит бир еганда ўртача 4 тоннагача овқат ейди. Инсон эса 70-80 кг оралиғида бўлади. Юнус алайҳиссалом китнинг қорнидаги зулумотда, денгиздаги зулумотда ва туннинг зулумотида якка ўзлари қолганларида Аллоҳ аз-Зоҳир сифати билан у зотни омонликка чиқарган. Аллоҳ таоло яна аз-Зоҳир сифати билан барча сир нарсаларни ошкора қилувчи Зотдир.",
  },
  {
    arabic: "الْبَاطِنُ",
    name: "ал-Ботин",
    desc: "У кўзга кўринмайди. Ҳаммадан пинҳон-махфий нарсаларни билиб турувчидир.\nНазар солишдан тўсилган нарса ботин дейилади. Аллоҳ таолони ал-Ботин дейилса, демак, У кўз билан кўришдан тўсилган деган маънода бўлади. «Кўзлар Уни идрок эта олмас, У кўзларни идрок этар» (Анъом, 103). Демак, Аллоҳни бу дунёда кўз билан кўриб бўлмайди. Ким Аллоҳни кўрганини даъво қилса, унинг даъвоси ёлғондир. Аммо уни охиратда кўрилади. «У Кунда (мўминларнинг) юзлари яшнаб, Парвардигорларига боқиб тургувчидир!» (Қиёмат, 22-23). Чунки инсоннинг кўриш қобилияти ва хусусияти бу дунёда Аллоҳни кўришга яроқсиздир. Лекин жаннатдаги инсон табиати бу дунёдаги табиатидан фарқ қилади. Жаннатда Аллоҳни кўришни имкони бор. Аллоҳ таоло кўзга кўринмай тўсилиши бандаларини синаб, имтиҳон қилиш учундир. Шунинг учун Аллоҳ таоло мўминларни «Кўзлари билан кўрмайдиган ғойибга ишонадиганлар», деб атаган.",
  },
  {
    arabic: "الْوَالِي",
    name: "ал-Волий",
    desc: "Ҳар бир нарсага волий, эга.\nал-Валий, ал-Мавло ва ал-Волий сўзлари бир хил асосдан олинган бўлиб, халқининг ишларини тадбир қилувчи деган маънода келади. Демак ал-Волий – ишларни мутлақ тадбир ва тасарруф қилувчи ҳамда коинотни тарбия қилувчи, деган маънодадир. Энди бу нарсаларни амалга оширувчи алийм, муқтадир ва хабир сифатларига ҳам эга бўлиши керак. Аллоҳ ушбу сифатларнинг барчасига эга Зотдир. \nал-Волий сифатига эга бўлиш учун маҳорат бўлиши даркор. Чунки билиш бошқа, маҳорат бошқа. Масалан, бир одам олий даражадаги билимини ишга солиб бир ускуна ясайди. Уни ишлатиб кўриш фурсати етганида у ишламайди. Чунки у хатоликка йўл қўйган бўлади. Демак инсоннинг маҳорати «ҳодиса» (яъни, янги пайдо бўлган), Аллоҳнинг маҳорати «қодийма» (азалдан бор бўлган)дир. Инсон гоҳида бир ишни амалга оширмоқчи бўлади, аммо унга қурби етмайди. У: «Тўсиқ ва монеълик бўлгани учун бажара олмадим», деб айтади. Аллоҳ эса «Нимани хоҳласа, қила олувчи зотдир» (Буруж, 16).",
  },
  {
    arabic: "الْمُتَعَالِي",
    name: "ал-Мутаъол",
    desc: "Нуқсонлардан юқори турувчи зот.\nҲамма нарса унинг азамати ва ҳукмронлиги остидадир. Ундан бошқа илоҳ йўқдир. Унга ғолиб келиб, У Зот билан тортишувчи кимса йўқ, деган маънодадир.\nУшбу сифат Қуръони каримнинг бир жойида келган. \n«У зот ғойибни ҳам, шоҳидни ҳам билгувчидир. У буюкдир, юксакдир» (Раъд, 9).\nЛекин баъзи одамлар ер юзида ўта қудратли куч мавжуд деб ваҳимага тушадилар. Аслида кўз қорачиғида кўриш имкони бўлган ўша қудратли куч Аллоҳнинг қўлидадир. Агар инсон Аллоҳнинг ал-Мутаъол сифатини тўлиқ маънода тушунса, у киши азизу мукаррам, кучли ва шижоатли бўлиб ҳаёт кечиради.\nИмом Табароний Абу Дардодан қилган ривоятларида қуйидагича келтирилади. Аллоҳ таоло: «Мен подшоҳларнинг подшоҳи ва эгасиман. Подшоҳларнинг қалби Менинг қўлимдадир. Агар бандалар менга итоат қилишса, подшоҳларининг қалбларини буриб, уларга нисбатан раҳмли ва меҳрибон қилиб қўяман.",
  },
  {
    arabic: "الْبَرُّ",
    name: "ал-Барр",
    desc: "Улуғ яхшилик қилувчи, яхшиликни муболаға тарзда амалга оширувчи, деган маънодадир. Агар ушбу исмни Аллоҳ таолога нисбатан ишлатсак, мутлақ яхшиликни тушунамиз. Аллоҳнинг мутлақ ато қилиши, дунё ва охиратдаги яхшилиги, қалбни бахт саодатга тўлдириши, инсонни соғ-омон қилиши, ризқини мўл-кўл қилишидир.\nал-Барр – Аллоҳнинг яхшилиги, ал-Бирр – Аллоҳнинг ато қилган нарсасидир.\nал-Бирр сўзини «дунё ва охиратдаги яхшилик» ва «тақво» деган маънолари ҳам бор. \nДунёдаги яхшилик – ҳидоят, соғлик, фикр сокинлиги, хотиржамлик, кенг ризқ, солиҳа хотин, солиҳ фарзанд ва ҳалол касблардир.\nОхиратдаги яхшилик – жаннатга мушарраф бўлиш, у ерда абадий қолиш, ҳурлар, хизматкорлар, остидан анҳор оқувчи боғлар, алвон мевалар, Аллоҳнинг юзига назар солиш ва энг улкани Аллоҳнинг розилигига мушарраф бўлишдир. Демак, Аллоҳ ал-Барр сифати билан бандаларига дунё ва охиратда яхшиликни раво кўради. Банданинг ушбу ал-Барр исмидаги насибаси ҳар қандай яхши ишларга машғул бўлишидир.",
  },
  {
    arabic: "التَّوَابُ",
    name: "ат-Таввоб",
    desc: "Бандаларни тавбага йўлловчи ва уларнинг тавбасини кўплаб қабул қилувчи Зот.\nат-Таввоб араб тили грамматикасида муболаға учун ишлатиладиган сўз. Агар ушбу сўзни Аллоҳ таолога нисбатан ишлатсак миқдор ва турини англаймиз. Яъни Аллоҳ таоло ҳар қанча миқдордаги гуноҳни ёки ҳар қандай турдаги гуноҳни бўлса ҳам кўплаб кечириб юбориши тушунилади.\nТавбанинг луғатдаги маъноси «Бир нарсадан бошқа нарсага қайтиш», деганидир. Тавба, инсонни хатолар қуршаб олганида қутулиш йўлидир. Тавба кишининг ёмонликлари ҳамла қилган пайтда ҳимоя қуролидир. Тавба ҳавойи нафс ҳамла қилганида тўғри йўлга солувчи йўлбошчидир. \n«Тавба қилишлари учун тавба эшиги очилди. Албатта, Аллоҳ тавбаларни қабул қилувчи ва раҳмли зотдир» (Тавба, 118)\n«Тавба эшиги очилди», деган сўзнинг маъноси нима? Яъни бандаларни тавбага буриш учун уларни машаққатга гирифтор қилади, деганидир. Агар Аллоҳ таоло улардаги соғликни бардавом ва мол-мулкларини узлуксиз кўпайтирганида улар шаҳватларига ғарқ бўлишар эди.",
  },
  {
    arabic: "الْمُنْتَقِمُ",
    name: "ал-Мунтақим",
    desc: "Золим ва осийлардан интиқом олувчи.\nал-Мунтақим сўзи агар инсонга нисбатан ишлатилса, уни маъқул кўрмаймиз. Лекин Аллоҳга нисбатан ишлатилса, у бутунлай гўзал маъно тусини олади. Шунинг учун «Аллоҳнинг гўзал исмлари», деб номланган. Аллоҳ таоло золимдан ўч олиб, бошқаларга озор беришдан тўхтатиб,  зулм қилишига барҳам беради. \nал-Мунтақим сўзи жазолаш деган маънодадир. Аллоҳ таоло одоб бериш учун азоблайди, бахтли қилиш учун одоб беради. Агар сен ҳаёти дунёда бир жиноятчини учратсангки, у одам ўлдириб, ўғирлик қилиб ва хоҳлаган ишини амалга ошириб одамларга зарар бергани учун қўлга олиниб қамаб қўйилса, одамлар бунинг қамалишидан хотиржамлик ва роҳатни ҳис қилишади. Ўч олиб, азоблаш мана шу маънода Аллоҳнинг камоллик сифатига лойиқ келади. Баъзида: «Мана шу одам нима қилинса, яхши томонга ўзгарар экан», деб айтиб қоласан. Аниқки, Аллоҳ унга қандайдир азобни бериб, ақл бовар қилмас даражада ўша ёмон кишини яхши кимсага айлантириб қўяди. ",
  },
  {
    arabic: "العَفُوُ",
    name: "ал-Афувв",
    desc: "Афв қилувчи деган манодадир. Ушбу улуғ исм хусусида гапиришдан олдин тавба ва афв хусусида сўзлаймиз. Аллоҳ таоло бандалари учун тавба эшигини очган. Чунки Аллоҳ бандалари хато ва савоб, яхши ва ёмон амал қилишларини билади. Аллоҳ уларни яратганда шаҳватни ҳам қўшиб яратган. Ушбу шаҳват Аллоҳ томон йўналтирилмаса ва Аллоҳ томонидан нур бириктирилмаса, демак, у эгасини барбод қилади. Демак, шаҳват ҳаракатга келтирувчи қувват ёки барбод қилувчи куч экан. Агар Аллоҳ тавба эшигини очмаганида, инсоннинг разолати янада кўпайиб, Аллоҳ раҳматидан ноумид бўлар эди. Шунинг учун Аллоҳ таоло: «Эй ўз жонларига исроф (жабр) қилган бандаларим, Аллоҳнинг раҳматидан ноумид бўлманг! Албатта, Аллоҳ барча гуноҳларни мағфират этар. Албатта, унинг ўзи ўта мағфиратли ва ўта раҳмли зотдир», деб айт деган. (Зумар, 53)\nАфв сўзи луғатда кетказувчи, ўчирувчи деган маънода ҳам келади. Демак, афв сўзи ёмонликларни ўчириб, гуноҳларни ўтиб юборади. У ал-Ғофур исмига яқин, лекин ундан кучлироқдир.",
  },
  {
    arabic: "الرَّؤُوفُ",
    name: "ар-Роуф",
    desc: "Ўта шафқатли ва меҳрибон, раҳм қилишнинг охирги даражаси, деган маънодадир. Баъзилар: «Аллоҳнинг ар-Роҳийм, яъни раҳм қилувчи исми билан ар-Роуф, яъни меҳрибон исми орасидаги фарқ нима?» деб сўраши мумкин. Жавоб шуки, агар мусибат етса Аллоҳ таоло ушбу инсонга раҳм қилади. Аммо меҳрибонлиги ўша кимсадан мусибат тушишидан олдин барча ёмонликлардан йироқлаштиришидир. Гоҳида ар-Роуф исми ҳимоя ва ёмонликни олдини олиш учун, ар-Роҳийм исми эса, муолажа учун келади. Аллоҳ таоло қаттиқ раҳм қилиши меҳрибонлиги сабаблидир. Меҳрибонлиги учун бандани гуноҳга йўлиқишидан олдин тавбага чорлайди. Мабодо гуноҳга дучор бўлса унга жазо лойиқ бўлиб қолади. Мана шу пайтда инсондан жазо ариши учун Аллоҳнинг раҳм айлаши тақозо қилади. Агар тавба қилсалар мен уларнинг дўстиман. Агар тавба қилмасалар мен уларнинг табибиман кўринишида бўлади. «Эй Роббимиз, албатта, сен шафқатли ва меҳрибонсан» (Ҳашр, 10). Мулоҳаза қилинса мана шу «ар-Роуф» ва «ар-Роҳим» исмлари биргаликда келади.",
  },
  {
    arabic: "َمَالِكُ ٱلْمُلْكُ",
    name: "Моликул мулк",
    desc: "Мулк эгаси. Бу дунёдаги ишларни ўзи хоҳлаганича амалга оширади. Унинг қазосини қайтарадиган ва ҳукмини ўзгартирадиган йўқ.\nҚуръони каримда ушбу исм ал-Малик, ал-Молик, ал-Малийк ва Маликул-мулк кўринишида келади.\n«Эй барча мулкнинг эгаси Роббим! Хоҳлаган кишингга мулк берурсан ва хоҳлаган кишингдан мулкни тортиб олурсан, хоҳлаган кишингни азиз қилурсан, хоҳлаган кишингни хор қилурсан. Барча яхшилик Сенинг қўлингда. Албатта, Сен ҳар бир нарсага қодирсан» (Оли Имрон сураси, 26 оят).\nИмом Ғаззолий Моликул мулк – Ўзининг хоҳишини Ўзининг мамлакатида, яъни мулкида қандай хоҳласа шундай амалга оширувчи, деган маънода деганлар.\nМуфассирлардан бирлари Моликул мулк – ҳақиқий мулк эгаси, деган маънодадир.",
  },
  {
    arabic: "ذُوالْجَلاَلِ وَالإكْرَامِ",
    name: "Зул-жалоли вал-икром",
    desc: "Шараф ва камол эгаси. Карам ва икром эгаси.\nАллоҳнинг исмларини икки қисмга бўлишимиз мумкин. Бир қисми У зотнинг куч-қувватига ишора қилади, иккинчи қисми камолотига ишора қилади. Камолотнинг барча турини «ал-Икром» исми ўзида мужассам қилади. Куч-қувватнинг барча кўринишини «Зул-жалол» исми ўзида мужассам қилади. Ушбу исм Қуръони каримнинг икки жойида, яъни ар-Роҳман сурасининг 27- ва 78-оятларида зикр қилинган. \nИмом ар-Розий айтдилар: «Ал-Икром» инъом маъносига яқиндир. Лекин ал-Икром хосроқ маънодадир. Чунки Аллоҳ таоло икром кўрсатмаган кишисига инъом бериши ҳам мумкин. Масалан, кофир кимсани Аллоҳ севмайди. Шу билан бирга унга мол дунё, соғлик, фарзанд, уй ва уловларни инъом қилаверади. Демак, буларнинг барчаси инъом, икром эмас. Аммо мўминларга ато қиладигани икромдир. Ҳар бир икром инъом бўлаверади. Аммо ҳар бир инъом икром бўла олмайди. Аллоҳнинг икром кўрсатиши икки турли бўлади. Биринчиси, дунёдаги тез келган икром. Иккинчиси, охиратга қолдирилган икром.",
  },
  {
    arabic: "الْمُقْسِطُ",
    name: "ал-Муқсит",
    desc: "Адолати ила мазлумларга нусрат ва золимларга жазо берувчи.\nУшбу сифат Аллоҳ таолога нисбатан ишлатилса, ҳукмида адолатли деган маънони беради. Зулмнинг турлари жуда ҳам кўп. Зулм Қиёмат куни зулумотдир. Масалан, эр хотиннинг ҳимоячиси бўлмагани учун зулм қилади. Бошлиқ қўл остидаги ишчиларга мансабини суиистеъмол қилиб зулм қила бошлайди. Агар сени кучинг одамларга зулм қилишга ундаса, Аллоҳнинг сенинг устингдаги қудратини эсингга ол. Инсоннинг илми кучайгани сари Аллоҳдан қўрқиши ҳам кучайиб боради. Борди-ю, банда кучга тўлиб, хоҳлаган нарсасини қилавераман, деб адолатсиз куч ишлатишга ўтса, Аллоҳнинг ғазабига дучор бўлади. Аллоҳнинг ғазаби эса ўта шиддатлидир.\nал-Муқсит – мазлум учун золимдан ҳаққини олиб берувчи деганидир. Бир банда бошқа бир бандага зулм қилсаю, Аллоҳ мазлумга золимдан ҳаққини олиб берса, золим зулмидан қайтиб Аллоҳга тавба қилса, демак Аллоҳ золимга икром кўрсатибди.",
  },
  {
    arabic: "الْجَامِعُ",
    name: "ал-Жомиъ",
    desc: "Жамловчи. Барча ҳақиқатларни жамловчи. Одамларни қиёмат куни жамловчи. Жамловчи кун деб номланишига сабаб, чунки ўша кунда золим ва мазлумни, кучли ва кучсизни, берган ва олганни, такаббурли ва тавозуълини Аллоҳ таоло бир биридан ҳаққини олиб бериш учун жамлайди. У кунда тоат ва ибодат қилганларга савоб бериш ҳамда гуноҳкорларга азоб бериш учун халойиқни аввалидан охиригача, жинлар ва инсонларни, осмон ва ер аҳлларини жамлайди. Ал-Жомиъ деганда, Аллоҳ камолотнинг барчасини зотида ҳам, сифатларида ҳам, феълларида ҳам жамловчидир. Ал-Жомиъ деганда, У зот бўлак бўлакка айланган махлуқотларни қайта тирилиш куни маҳшар майдонида жам қилади, деган маънода ҳам тушунилади. Гоҳида инсон бирор нарсасини йўқотиб қўйса: «Шубҳа йўқ кунда одамларни жамловчи бўлган Зот Аллоҳим! Мен билан ҳожатим орасини жамла», деб айтиб дуо қилса, иншааллоҳ ҳожати ҳосил бўлади. Ал-Жомиъ исми Қуръони каримнинг бир неча оятларида келган.",
  },
  {
    arabic: "ٱلْغَنيُّ",
    name: "ал-Ғанийй",
    desc: "Беҳожат. Унинг ҳеч кимга ва ҳеч нарсага ҳожати тушмайди.\nХолиқнинг шаъни, У ҳар бир нарсада беҳожатдир. Махлуқнинг шаъни, у барча нарсага муҳтождир. Аллоҳ таоло Муҳаммад сураси, 38-оятда: « Ҳолбуки, Аллоҳ бой, сизлар камбағалсизлар», деб айтган. Кўпинча Қуръонда ал-Ғаний (беҳожат) сўзи билан ал-Ҳамийд (мақталган) сўзи яқин бўлиб келади. Чунки Аллоҳ бандаларидан беҳожат, шу билан бирга махлуқлар Уни мақташади. Аммо инсон бадавлат ва бирор кишига эҳтиёжи тушмасдан беҳожат бўлиши мумкин, аммо қўпол, такаббур, кеккайган ва ёқтирилмайдиган киши бўлади. Лекин еру осмоннинг холиқи комил ва беҳожатдир. Аллоҳ Ўзи беҳожат, шу билан бирга махлуқотни овқат, ичимлик ва ҳаво билан таъминлайверади. Инсоннинг беҳожатлиги нисбийдир. Чунки инсон беҳожат бўлиши билан бир вақтнинг ўзида сон саноқсиз нарсаларга муҳтождир.",
  },
  {
    arabic: "ٱلْمُغْنِيُّ",
    name: "ал-Муғний",
    desc: "Беҳожат қилувчи. У зот ўз бандаларидан хоҳлаганини беҳожат қилиб қўяди. Баъзи кишиларни ўта зукко ва ақлли бўлишларига қарамасдан бирор мол-дунёга эга бўлмаганларини кўрасан. Баъзи одамларни содда ва оддий бўлишларига қарамасдан, уларда тўла тўкис мол-дунё борлигини кўрасан. Мана шу Аллоҳ таолонинг ал-Муғний исми бўлиб, У Зот хоҳлаган кишини беҳожат қилиб қўйиши тушунилади. \nАл-Муғний – бандаларини Ўзининг маърифати билан беҳожат қилиб қўяди. Шунда банда Аллоҳнинг маърифати билан бошқа нарсадан беҳожат бўлади.",
  },
  {
    arabic: "اَلْمَانِعُ",
    name: "ал-Мониъ",
    desc: "Манъ қилувчи. У ҳимоя қилувчи деган маънода ҳам келади. У Зот хусуматчидан, душмандан, ёмонлик тушишидан, озор берувчи нарсалардан ҳамда дин ва дунёдаги тўсиқлардан сени ҳимоя қилади.\nҲимояланган эканини ҳис қилиш ажойиб ҳис бўлиб, инсон Аллоҳ ҳимоясида ва муҳофазасида эканини англатади. \nГоҳида инсон энг замонавий машинага ўтириб сафар қилади. Аммо мақсад қилган маконига етиб бора олмайди. Гоҳида эски машинани миниб, мақсад қилган маконига соғ омон етиб олади. У ҳимояга олингани учун ўзида омонлик ва хотиржамликни ҳис қилади. Чунки мусибат етишини ҳис қилиб яшаш ундан ҳам катта мусибатдир. Масалан, камбағалликдан қўрқиш айни камбағалликдир. Касалликдан қўрқиш айни камбағалликдир. Шунинг учун агар Аллоҳ таоло тўғри йўлдан чалғиган гумроҳларни азобламоқчи бўлса, улардан хотиржамликни олиб қўяди. Шунинг учун улар бадавлат, кучли ва ақлли бўлишларига қарамасдан хавфда яшайдилар. Аллоҳ мушрикларни ширк келтиргани сабаб қалбига хавф солиб қўяди.",
  },
  {
    arabic: "الضَّارَ",
    name: "аз-Зорр",
    desc: "Хоҳлаганига зарар қилувчи. Аз-Зорр фойда деган сўзнинг аксидир. Инсон қачон мунофиқлик қилади ёки қачон риё қилади ёки қачон қўрқади ёки қачон бўйин эгади ёки қачон таҳқирланади? Қачонки ўзи каби бир инсон фойда бериши ёки зарар бериши мумкин деган тушунчада бўлса ушбу нарсаларга йўлиқади. Аммо фойдани ҳам, зарарни ҳам фақат Аллоҳ беради деган эътиқодда бўлса, бошини баланд кўтариб азизликда юради. Барча қувват, азизлик ва журъатнинг сабаби Аллоҳдан ўзга фойда берувчи ҳам, зарар берувчи ҳам йўқ эканига иймон келтиришдадир. Мўмин банда Аллоҳнинг ҳукмига таслим ва унинг йўлида сабрли бўлади. Мўмин Аллоҳнинг ҳукмида сабр қилса Аллоҳ унинг қалбига сукунатни солиб қўяди.",
  },
  {
    arabic: "النَّافِعُ",
    name: "ан-Нофиъ",
    desc: "Манфаат берувчи.\nАн-Нофиъ – зарар деган сўзнинг аксидир. Инсон қачон мунофиқлик қилади ёки қачон риё қилади ёки қачон қўрқади ёки қачон бўйин эгади ёки қачон таҳқирланади? Қачонки ўзи каби бир инсон фойда бериши ёки зарар бериши мумкин деган тушунчада бўлса ушбу нарсаларга йўлиқади. Аммо фойдани ҳам, зарарни ҳам фақат Аллоҳ беради, деган эътиқодда бўлса, бошини баланд кўтариб азизликда юради. Барча қувват, азизлик ва журъатнинг сабаби Аллоҳдан ўзга фойда берувчи ҳам, зарар берувчи ҳам йўқ эканига иймон келтиришдадир. Кўплаб диний манбаларда мана шу «аз-Зорр» ва «ан-Нофиъ» исмларини оддий сабабга биноан бирга ишлатиш шарт. Ўша оддий сабаб, Аллоҳ таоло манфаат етиши учун зарар беришидир. Яъни, баъзи кимсаларни қаттиқ касалликка дучор қилиши ёки иқтисодий муаммога тушириши, у банда Аллоҳга қайтиб, тавба қилиши учундир.",
  },
  {
    arabic: "النُّورُ",
    name: "ан-Нур",
    desc: "Ўзи ўзи ила зоҳир бўлган ва ўзгаларни зоҳир қилган.mНур сўзининг луғавий маъноси зиё ва ёруғликдир. Инсон ушбу Ер куррасида нима учун яратилди, у Ерда нима қилиши даркор эди. Еб, ичиб ва ухласа иш ниҳоясига етадими? Ёки бунинг бошқа муҳим вазифалари борми? Қачон ўлади? Нима учун ўлади? Нима учун яшайди? Яхшилик қилади, ёмонлик қилади, рост сўзлайди, ёлғон сўзлайди ва яна нималар қилади? Мана шундай қийин вазиятда Аллоҳнинг китоби келиб: «Сен кенглиги Еру осмончалик бўлган жаннат учун яратилдинг. Сен ҳаёти дунёдалик пайтингда солиҳ амалларни бажарсанг, жаннатга кирасан. Сен Аллоҳ таолога боғланиб, яқин бўлмагунингча бахтли бўлмайсан», деб сенга ҳаёт ҳақиқати, инсон ҳақиқатини ўргатиб, уни бажар, буни бажарма, деб ҳалол ва ҳаром, яхши ва ёмон, ҳақ ва ботилни баён қилиб, оламнинг яралиши ва ниҳоя топишини ўргатади. Аниқки Аллоҳ Қуръони карим орқали буларни барчаси ҳақида хабар берган.",
  },
  {
    arabic: "الْهَادِي",
    name: "ал-Ҳодий",
    desc: "Ҳидоят қилувчи. У зот ўз фазли ила хоҳлаган кимсани ҳидоят қилади. Яъни Аллоҳ кимни тўғри йўлга ҳидоят қилса, албатта, ўз хоҳиши ва фазли ила ҳидоят қилади. Ҳидоят қилади дегани, тўғри йўлга йўллаб қўяди, деган маънодадир. Агар сен Ер ва осмон халқ қилиниши хусусида фикрласанг, Аллоҳ маърифати томон кенг қадам ташлаган бўласан. Чунки Ер ва осмон хусусида фикрлаш Аллоҳ томон кирадиган эшигимизни кенгайтириб, У томон бўлган йўлни қисқартиради. Коинот бизни У Зот томон ҳидоят қилади. Унда аввалги ўтган қавмларнинг ва узоқ келажакнинг хабари бор. Унда ўлгандан кейинги хабарлар, жаннат ва дўзах васфи, охират диёрининг манзараси ҳақида хабарлар бор. Ҳидоятларнинг энг аввали ва буюги, коинотда Аллоҳнинг илми, ҳикмати, қудрати, бойлиги, ҳалимлигини кўришингдир. Аллоҳ таоло сени ҳидлаш ҳис туйғуси билан жиҳозлаб қўйган.",
  },
  {
    arabic: "الْبَدِيعُ",
    name: "ал-Бадийъ",
    desc: "Ўхшаши йўқ нарсаларни яратувчи. Аммо инсон бирор нарса ихтиро қилса, шак-шубҳасиз, у Аллоҳнинг махлуқотларига тақлид қилади. Масалан, самолётни қушдан ўрганиб ва сув ости кемасини балиқдан ўрганиб ихтиро қилган. Ушбу исмнинг нозик томонлари билан ўрганадиган бўлсак, ким олдин бирор киши қилмаган ишни амалга оширса, араб тилида «абдаъа» дейилади. Бидъат сўзи ҳам шу сўздан олинган. Чунки бидъат амални ҳам аввал ҳеч ким бажармаган бўлади. Бидъатнинг икки хил маъноси бор. Луғавий маънода ҳар бир янги нарса бидъат дейилади. Шариатда эса динда бўлмаган нарсани янгилик қилиш бидъат дейилади. Динда бидъат ишни амалга ошириш ҳаром амалдир. Мўмин кишини ҳалим, раҳмдил, адолатли бўлишга чақирганда Аллоҳнинг ана шу исмлари бўлмиш ал-Ҳалим, ар-Роҳим, ал-Адл исмлари билан хулқланишга чақирамиз. Аммо ушбу ал-Бадиъ исмида эса аксинча бўлиб, ақида, ибодат ва сулукда янгилик қилмасликка чақирилади. Чунки динда янгилик яратган одам бир суннатни тарк қилиш эвазига янгиликни яратган бўлади.",
  },
  {
    arabic: "اَلْبَاقِي",
    name: "ал-Боқий",
    desc: "Боқий қолувчи. У доимий бордир, унга фонийлик етмайди. Демак, боқийлик дегани, фонийликнинг аксидир. Аллоҳнинг боқий қолувчи нарсалари деганда Аллоҳга итоат қилиш ва савобини кутиш, деганидир. Гоҳида тоат ибодат машаққатли ва қийин бўлади. Мукаллаф бўлинган ишлар албатта машаққат билан қўлга киритилади. Аммо ундаги машаққатлар йўқ бўлиб, савоби боқий қолади. Аммо шаҳвоний роҳат эса йўқ бўлиб, унинг азоби боқий қолади. Демак, мўмин киши боқий қоладиган нарсалар ҳақида фикр юритади. \nал Боқийнинг яна бир маъноси, боқий қолувчи солиҳ амаллардир. У Аллоҳ буйруқларида истиқомат ва бардавом юришдир. Инсон жидду жаҳд қилиб, қийинчиликларни бошидан ўтказиб, натижа ва икром кўрсатилишини кутади. Масалан, фитналар кенг қулоч отиб, аёллар ярим яланғоч бўлган ва барча гуноҳ маъсиятга чорлаган даврда яшамоқдасан. Энди сен ўзингни тутиб, нафсингни Аллоҳ буйруқларига бўйсундирсанг, сен учун нима қолади? Албатта сен учун тоат ибодатнинг савоби ва тавфиқи қолади.",
  },
  {
    arabic: "الْوَارِثُ",
    name: "ал-Ворис",
    desc: "Мавжудотлар йўқ бўлганда ҳам боқий қолувчи зот. Дунё ҳаётида ҳамма ҳалок бўлади фақат ал-Ворис сифатли Зот тирик қолади. Чунки Аллоҳ таоло тирик ва боқий бўлиб, меросхўр бўлувчидир. Одатда мана шу уй менинг мулким, деб айтилади. Бу мажозий гап. Аслида уй Аллоҳникидир. Масалан, бир гала туя ҳайдаб кетаётган аъробийларнинг биридан бу туялар кимники? деб сўралганида, у «Улар Аллоҳники, менинг қўл остимда, холос», деб жавоб берган. Шунинг учун баъзи иморатлар устига «Мулк Аллоҳникидир», деб ёзиб қўйилади.\nМол-дунё сенинг қўлингга омонат юзасидан вақтинча берилган. Бундан мақсад сени қандай йўл тутишингни синаш учун холос.\nДунёдаги энг бадавлат инсонлардан бири олтинларини темир эшикли бир хонага қўйган. Эшик қаттиқ маҳкамланган. У киши кириб кетганида эшик беркилиб қолган. Хонадон аҳллари уни сафарга кетган деб ўйлашган. У киши эса очликдан вафот қилган. Охирги нафасдан олдин бармоғидан қон чиқариб, дунёдаги энг бадавлат одам очликдан вафот қилди, деб ёзиб қолдирган.",
  },
  {
    arabic: "الرَّشِيدُ",
    name: "ар-Рашийд",
    desc: "Тўғри йўлга иршод қилувчи. Ар-Рашийд сифати Аллоҳга васф қилинса, мутлақ тўғри йўлга бошловчи деган маънони англатади. Аллоҳнинг илми, қудрати, раҳмати мутлақдир. Аммо инсоннинг исми ва сифатлари нисбийдир. Аллоҳнинг сифатлари мутлақ ва барча нарса Аллоҳнинг измида эканига инсон иймон келтирса, унинг нафсида хотиржамлик ҳукм суради. Бундай хотиржамликни йўқотганлар яхши билишади. Чунки Аллоҳ соғлик, зукколик, мол дунё ва гўзалликни кўплаб махлуқларига ато қилаверади. Аммо хотиржамликни Ўзининг соф мўмин бандаларига ато қилади холос. Биз Аллоҳнинг исм ва сифатлари мутлақ эканига аниқ ишондик. Унда бузилиш қайси нуқтада юзага келади, деган савол пайдо бўлади? Бузилиш Аллоҳ ато қилган неъматларни нотўғри ишлатиш орқали юзага келади.",
  },
  {
    arabic: "الصَّبُورُ",
    name: "ас-Сабур",
    desc: "Ўта сабрли. Осийларни азоблашга шошилмайди.\nГоҳида Аллоҳни инкор қиладиган кофирлар гуноҳларга ботганини ва бошқаларга зулм қилаётганини кўриб иймони заифлар: «Аллоҳ қаерда? Нима учун уларни жазоламаяпти?» деб айтадилар. Аллоҳ таоло бу ҳақда: «Сен ҳаргиз, Аллоҳ золимлар қилаётган нарсадан ғофил, деб гумон қилма. Фақатгина уларни кўзлар қотиб қоладиган кунгача қўйиб қўяди, холос» (Иброҳим, 42), деб айтган. Аллоҳ таоло бу нарсалардан ғофил эмас, фақат инсоннинг қай даражаги хатаргача етиб боргунича Ўзини билмаганга солиб, қўйиб беради, холос. Ўзининг етук ҳикматига биноан азоблашни кечиктириб, сабр қилади.\nБаъзилар: «Аллоҳнинг ал-Ҳалим сифати билан ас-Сабур сифати орасида қандай фарқ бор?», деб сўраши мумкин. Жавоб шуки, ас-Сабур исми фақат азобни кечиктиришга эътибор қаратади. Аммо ал-Ҳалим исми азобни кечиктириб, уни охирида афв қилиб ҳам юборади. \nАллоҳнинг ас-Сабур исмидаги инсоннинг насибаси, Роббиси учун сабр қилмоғидир.",
  },
];

const AllohNames = () => {
  return (
    <div className="grid">
      {allohNames.map((c, i) => (
        <Link
          to={`${i}`}
          key={i}
          className="bg-background/20 backdrop-blur-sm border-b-2 border-primary p-2 flex justify-between items-center text-primary cursor-pointer select-none hover:bg-primary hover:text-accent transition-all"
        >
          <h1 className="text-2xl bg-black/30 h-12 w-12 rounded-full flex justify-center items-center max-md:-order-2">
            {i + 1}
          </h1>
          <h1 className="text-2xl">{c.name}</h1>
          <h1 className="text-4xl">{c.arabic}</h1>
        </Link>
      ))}
    </div>
  );
};

export default AllohNames;
